In [1]:
from IPython.display import display, HTML
display(HTML("""
<style>
div.container{width:90% !important;}
div.cell.code_cell.rendered{width:100%;}
div.input_prompt{padding:0px;}
div.CodeMirror {font-family:Consolas; font-size:12pt;}
div.text_cell_render.rendered_html{font-size:12pt;}
div.output {font-size:12pt; font-weight:bold;}
div.input {font-family:Consolas; font-size:12pt;}
div.prompt {min-width:70px;}
div#toc-wrapper{padding-top:120px;}
div.text_cell_render ul li{font-size:12pt;padding:5px;}
table.dataframe{font-size:12px;}
</style>
"""))

# 패키지 로드

In [1]:
import pandas as pd
import numpy as np

In [ ]:
from dotenv import load_dotenv
import os
import requests
from bs4 import BeautifulSoup
from urllib.request import url

# 데이터 백업

## 카페 매출

In [22]:
sw_pd.to_csv('data/수원시팔달구열처리백업.csv', index=False)

In [3]:
sw_pd = pd.read_csv('data/수원시팔달구열처리백업.csv')
sw_pd.head(1)

      기준년월일     행정동코드  시간대 성별  연령별  요일   매출금액  매출건수
0  20230101  41115650    1  F    6   7  14393     2

In [25]:
sw_pd_gender_sum.to_csv('data/수원시팔달구성별합백업.csv', index=False)

In [23]:
sw_pd_gender_sum = pd.read_csv('data/수원시팔달구성별합백업.csv')
sw_pd_gender_sum.head(1)

      기준년월일     행정동코드  시간대  연령별  요일   매출금액  매출건수
0  20230101  41115650    1    2   7  17678     2

In [212]:
sw_pd_df.to_csv('data/수원시팔달구행정동명백업.csv', index=False)

In [35]:
sw_pd_df = pd.read_csv('data/수원시팔달구행정동명백업.csv')
sw_pd_df.head(1)

      기준년월일  시간대  연령별  요일   매출금액  매출건수 행정동명
0  20230101    1    2   7  17678     2  매교동

## 행정동 코드

In [13]:
code_sw_pd.to_csv('data/행정동코드백업.csv', index=False)

In [8]:
code_sw_pd = pd.read_csv('../data/행정동코드백업.csv')
code_sw_pd.head(1)

      행정동코드  시도명     시군구명 읍면동명
0  41115650  경기도  수원시 팔달구  매교동

In [56]:
code_sw.to_csv('data/수원시 행정동코드 백업.csv', index=False)

In [37]:
code_sw = pd.read_csv('data/수원시 행정동코드 백업.csv')

## 기상청

In [199]:
sw_rainfall.to_csv('data/행궁동 강수량 백업.csv', index=False)

In [16]:
sw_rainfall = pd.read_csv('data/행궁동 강수량 백업.csv')
sw_rainfall.head(1)

      기준년월일  시간대      시간  강수량
0  20230106    3  1000.0  0.1

In [204]:
sw_rainfall_group.to_csv('data/행궁동 강수량 시간대별 백업.csv', index=False)

In [17]:
sw_rainfall_group = pd.read_csv('data/행궁동 강수량 시간대별 백업.csv')
sw_rainfall_group.head(1)

      기준년월일  시간대  강수량
0  20230106    3  0.1

In [224]:
sw_temp_group.to_csv('data/행궁동 기온 시간대별 백업.csv', index=False)

In [18]:
sw_temp_group = pd.read_csv('data/행궁동 기온 시간대별 백업.csv')
sw_temp_group.head(1)

      기준년월일  시간대   기온
0  20230101    1  2.1

## 구별 기상

In [27]:
sw_gwonsun.to_csv('data/수원시 권선구.csv', index=False)
sw_jangan.to_csv('data/수원시 권선구.csv', index=False)
sw_paldal.to_csv('data/수원시 권선구.csv', index=False)
sw_yeongtong.to_csv('data/수원시 권선구.csv', index=False)

In [ ]:
sw_gwonsun = pd.read_csv('data/수원시 권선구.csv', index=False)
sw_jangan = pd.read_csv('data/수원시 권선구.csv', index=False)
sw_paldal = pd.read_csv('data/수원시 권선구.csv', index=False)
sw_yeongtong = pd.read_csv('data/수원시 권선구.csv', index=False)

## 동별 기상

In [36]:
sw_rain.to_csv('data/수원시 동별 강수.csv', index=False)
sw_temp.to_csv('data/수원시 동별 기온.csv', index=False)

In [9]:
sw_rain = pd.read_csv('data/수원시 동별 강수.csv')
sw_temp = pd.read_csv('data/수원시 동별 기온.csv')

## 종합

In [23]:
sw_data_sum.to_csv('data/SUWON_S_DATA_TABLE_GENDER_SUM.csv', index=False)

In [28]:
sw_data_sum = pd.read_csv('data/SUWON_S_DATA_TABLE_GENDER_SUM.csv')

## 배달데이터

In [39]:
sw_del_sum.to_csv('data/수원시 팔달구 배달 데이터.csv', index=False)

In [ ]:
sw_del_sum = pd.read_csv('data/수원시 팔달구 배달 데이터.csv')

In [53]:
sw_merged.to_csv('data/수원시 팔달구 카페_배달 데이터.csv', index=False)

In [ ]:
sw_merged = pd.read_csv('data/수원시 팔달구 카페_배달 데이터.csv')

## 음식전체

In [41]:
# 수원시 팔달구 전체
sw_food_temp_sum.to_csv('data/SUWON_PALDAL_FOOD_DATA_TABLE.csv', index=False)

In [34]:
sw_food_temp_sum = pd.read_csv('data/SUWON_FOOD_DATA_TABLE.csv')

In [11]:
# 수원시 전체
sw_food_data.to_csv('data/SUWON_FOOD_DATA_TABLE.csv', index=False)

In [28]:
sw_food_data = pd.read_csv('data/SUWON_FOOD_DATA_TABLE.csv')

## 배달, 한식

In [7]:
sw_delivery.to_csv('data/수원시 배달 데이터백업.csv', index=False)
sw_koreanfood.to_csv('data/수원시 한식 데이터백업.csv', index=False)

In [3]:
sw_delivery = pd.read_csv('data/수원시 배달 데이터백업.csv')
sw_koreanfood = pd.read_csv('data/수원시 한식 데이터백업.csv')

In [47]:
sw_rest.to_csv('data/수원시 휴게소 데이터백업.csv', index=False)
sw_bakery.to_csv('data/수원시 빵집 데이터백업.csv', index=False)

In [ ]:
sw_rest = pd.read_csv('data/수원시 휴게소 데이터백업.csv', index=False)
sw_bakery = pd.read_csv('data/수원시 빵집 데이터백업.csv', index=False)

In [46]:
sw_koreanfood.to_csv('data/수원시 한식 동별 데이터백업.csv', index=False)

In [40]:
sw_koreanfood = pd.read_csv('data/수원시 한식 동별 데이터백업.csv')

# 수원시 카페 데이터(23-25)

In [2]:
df = [pd.read_csv(f'c:/Users/Admin/AI/downloads/카드소비데이터 수원시/tbsh_gyeonggi_day_20230{i}_수원시.csv') for i in range(1,10)]
df_23_1 = pd.concat(df, ignore_index=True)

df = [pd.read_csv(f'c:/Users/Admin/AI/downloads/카드소비데이터 수원시/tbsh_gyeonggi_day_2023{i}_수원시.csv') for i in range(10,13)]
df_23_2 = pd.concat(df, ignore_index=True)

display(df_23_1.head(1)), display(df_23_2.head(1))

,ta_ymd,cty_rgn_no,admi_cty_no,card_tpbuz_cd,card_tpbuz_nm_1,card_tpbuz_nm_2,hour,sex,age,day,amt,cnt
0,20230101,41111,41111560,D02,소매/유통,건강/기호식품,5,F,5,7,99502,2

,ta_ymd,cty_rgn_no,admi_cty_no,card_tpbuz_cd,card_tpbuz_nm_1,card_tpbuz_nm_2,hour,sex,age,day,amt,cnt
0,20231001,41111,41111560,D02,소매/유통,건강/기호식품,3,M,7,7,99502,2

(None, None)

In [89]:
df_23_1 = df_23_1[df_23_1['card_tpbuz_nm_2']=='커피/음료']
df_23_2 = df_23_2[df_23_2['card_tpbuz_nm_2']=='커피/음료']
df_23 = pd.concat([df_23_1, df_23_2]).reset_index(drop=True)
df_23.head(2)

,ta_ymd,cty_rgn_no,admi_cty_no,card_tpbuz_cd,card_tpbuz_nm_1,card_tpbuz_nm_2,hour,sex,age,day,amt,cnt
0,20230101,41111,41111560,Q13,음식,커피/음료,1,F,3,7,259309,2
1,20230101,41111,41111560,Q13,음식,커피/음료,1,M,3,7,62359,9

In [3]:
df = [pd.read_csv(f'c:/Users/Admin/AI/downloads/카드소비데이터 수원시/tbsh_gyeonggi_day_20240{i}_수원시.csv') for i in range(1,10)]
df_24_1 = pd.concat(df, ignore_index=True)

df = [pd.read_csv(f'c:/Users/Admin/AI/downloads/카드소비데이터 수원시/tbsh_gyeonggi_day_2024{i}_수원시.csv') for i in range(10,12)]
df_24_2 = pd.concat(df, ignore_index=True)

df_24_3 = pd.read_csv(f'c:/Users/Admin/AI/downloads/카드소비데이터 수원시/tbsh_gyeonggi_day_202412_수원시.csv', encoding='cp949') 

display(df_24_1.head(1)), display(df_24_2.head(1)), display(df_24_3.head(1))

,ta_ymd,cty_rgn_no,admi_cty_no,card_tpbuz_cd,card_tpbuz_nm_1,card_tpbuz_nm_2,hour,sex,age,day,amt,cnt
0,20240101,41111,41111560,D02,소매/유통,건강/기호식품,4,F,7,1,32339,3

,ta_ymd,cty_rgn_no,admi_cty_no,card_tpbuz_cd,card_tpbuz_nm_1,card_tpbuz_nm_2,hour,sex,age,day,amt,cnt
0,20241001,41111,41111560,D01,소매/유통,가전제품,4,M,5,2,167558,2

,ta_ymd,cty_rgn_no,admi_cty_no,card_tpbuz_cd,card_tpbuz_nm_1,card_tpbuz_nm_2,hour,sex,age,day,amt,cnt
0,20241201,41111,41111560,D02,소매/유통,건강/기호식품,3,M,3,7,181077,5

(None, None, None)

In [93]:
df_24_1 = df_24_1[df_24_1['card_tpbuz_nm_2']=='커피/음료']
df_24_2 = df_24_2[df_24_2['card_tpbuz_nm_2']=='커피/음료']
df_24_3 = df_24_3[df_24_3['card_tpbuz_nm_2']=='커피/음료']
df_24 = pd.concat([df_24_1, df_24_2, df_24_3]).reset_index(drop=True)
df_24.head(1)

,ta_ymd,cty_rgn_no,admi_cty_no,card_tpbuz_cd,card_tpbuz_nm_1,card_tpbuz_nm_2,hour,sex,age,day,amt,cnt
0,20240101,41111,41111560,Q13,음식,커피/음료,1,F,3,1,15019,5

In [4]:
df = [pd.read_csv(f'c:/Users/Admin/AI/downloads/카드소비데이터 수원시/tbsh_gyeonggi_day_20250{i}_수원시.csv') for i in range(1,10)]
df_25_1 = pd.concat(df, ignore_index=True)

df_25_2 = pd.read_csv(f'c:/Users/Admin/AI/downloads/카드소비데이터 수원시/tbsh_gyeonggi_day_202510_수원시.csv')

display(df_25_1.head(1)), display(df_25_2.head(1))

,ta_ymd,cty_rgn_no,admi_cty_no,card_tpbuz_cd,card_tpbuz_nm_1,card_tpbuz_nm_2,hour,sex,age,day,amt,cnt
0,20250101,41111,41111560,D02,소매/유통,건강/기호식품,3,M,4,3,144301,2

,ta_ymd,cty_rgn_no,admi_cty_no,card_tpbuz_cd,card_tpbuz_nm_1,card_tpbuz_nm_2,hour,sex,age,day,amt,cnt
0,20251001,41111,41111560,D01,소매/유통,가전제품,3,F,6,3,379702,2

(None, None)

In [96]:
df_25_1 = df_25_1[df_25_1['card_tpbuz_nm_2']=='커피/음료']
df_25_2 = df_25_2[df_25_2['card_tpbuz_nm_2']=='커피/음료']
df_25 = pd.concat([df_25_1, df_25_2]).reset_index(drop=True)
df_25.head(1)

,ta_ymd,cty_rgn_no,admi_cty_no,card_tpbuz_cd,card_tpbuz_nm_1,card_tpbuz_nm_2,hour,sex,age,day,amt,cnt
0,20250101,41111,41111560,Q13,음식,커피/음료,1,F,3,3,43023,3

In [15]:
df_23.shape, df_24.shape, df_25.shape

((1558156, 12), (1609414, 12), (1354069, 12))

In [97]:
df_23_25 = pd.concat([df_23, df_24, df_25]).reset_index(drop=True)
df_23_25

,ta_ymd,cty_rgn_no,admi_cty_no,card_tpbuz_cd,card_tpbuz_nm_1,card_tpbuz_nm_2,hour,sex,age,day,amt,cnt
0,20230101,41111,41111560,Q13,음식,커피/음료,1,F,3,7,259309,2
1,20230101,41111,41111560,Q13,음식,커피/음료,1,M,3,7,62359,9
2,20230101,41111,41111560,Q13,음식,커피/음료,1,M,4,7,7822,2
3,20230101,41111,41111560,Q13,음식,커피/음료,1,M,5,7,23780,3
4,20230101,41111,41111560,Q13,음식,커피/음료,1,M,7,7,3755,2
...,...,...,...,...,...,...,...,...,...,...,...,...
4521634,20251031,41117,41117610,Q13,음식,커피/음료,10,F,5,5,91990,2
4521635,20251031,41117,41117610,Q13,음식,커피/음료,10,M,3,5,25344,6
4521636,20251031,41117,41117610,Q13,음식,커피/음료,10,M,4,5,2085,2
4521637,20251031,41117,41117610,Q13,음식,커피/음료,10,M,5,5,81039,2
4521638,20251031,41117,41117610,Q13,음식,커피/음료,10,M,6,5,6884,2

In [101]:
df_23_25[df_23_25['amt']==0]

,ta_ymd,cty_rgn_no,admi_cty_no,card_tpbuz_cd,card_tpbuz_nm_1,card_tpbuz_nm_2,hour,sex,age,day,amt,cnt
386402,20230406,41117,41117530,Q13,음식,커피/음료,1,F,8,4,0,2
1581566,20240106,41115,41115680,Q13,음식,커피/음료,9,M,7,6,0,0
1591132,20240108,41117,41117596,Q13,음식,커피/음료,2,F,7,1,0,0
1612246,20240113,41117,41117596,Q13,음식,커피/음료,9,F,7,6,0,0
1623581,20240116,41117,41117510,Q13,음식,커피/음료,2,F,6,2,0,0
1652198,20240123,41115,41115720,Q13,음식,커피/음료,3,F,9,2,0,0
1661377,20240125,41117,41117585,Q13,음식,커피/음료,7,F,8,4,0,0
1681265,20240130,41115,41115710,Q13,음식,커피/음료,2,M,8,2,0,0
1682623,20240130,41117,41117596,Q13,음식,커피/음료,9,F,7,2,0,0
1755988,20240217,41113,41113680,Q13,음식,커피/음료,4,M,8,6,0,0
1889391,20240319,41117,41117570,Q13,음식,커피/음료,5,F,8,2,0,3
2805863,20241008,41117,41117585,Q13,음식,커피/음료,2,F,7,2,0,2

## 행정동 데이터

In [18]:
code_all = pd.read_excel('../data/행정동코드.xlsx')
code_sw_pd = code_all[code_all['시군구명']=='수원시 팔달구'].reset_index(drop=True)
code_sw_pd = code_sw_pd.drop(0).reset_index(drop=True)
code_sw_pd = code_sw_pd.drop(['생성일자', '말소일자'], axis=1)
code_sw_pd['행정동코드'] = code_sw_pd['행정동코드']//100
code_sw_pd

      행정동코드  시도명     시군구명  읍면동명
0  41115650  경기도  수원시 팔달구   매교동
1  41115660  경기도  수원시 팔달구   매산동
2  41115670  경기도  수원시 팔달구   고등동
3  41115680  경기도  수원시 팔달구  화서1동
4  41115690  경기도  수원시 팔달구  화서2동
5  41115700  경기도  수원시 팔달구    지동
6  41115710  경기도  수원시 팔달구  우만1동
7  41115720  경기도  수원시 팔달구  우만2동
8  41115730  경기도  수원시 팔달구   인계동
9  41115740  경기도  수원시 팔달구   행궁동

In [16]:
code_all = pd.read_excel('../data/행정동코드.xlsx')
code_sw = code_all[code_all['시군구명'].str.contains('수원시', na=False)].reset_index(drop=True)
code_sw.dropna(subset=['읍면동명'], inplace=True)
code_sw['행정동코드'] = code_sw['행정동코드']//100
code_sw.drop(['시도명', '생성일자', '말소일자'], axis=1, inplace=True)
code_sw['시군구명'] = code_sw['시군구명']+' '+code_sw['읍면동명']
code_sw.drop('읍면동명', axis=1, inplace=True)
code_sw

       행정동코드          시군구명
2   41111560   수원시 장안구 파장동
3   41111566   수원시 장안구 율천동
4   41111571  수원시 장안구 정자1동
5   41111572  수원시 장안구 정자2동
6   41111573  수원시 장안구 정자3동
7   41111580   수원시 장안구 영화동
8   41111591   수원시 장안구 송죽동
9   41111597  수원시 장안구 조원1동
10  41111598  수원시 장안구 조원2동
11  41111600   수원시 장안구 연무동
13  41113520  수원시 권선구 세류1동
14  41113530  수원시 권선구 세류2동
15  41113540  수원시 권선구 세류3동
16  41113550    수원시 권선구 평동
17  41113560   수원시 권선구 서둔동
18  41113650   수원시 권선구 구운동
19  41113662   수원시 권선구 금곡동
20  41113664  수원시 권선구 호매실동
21  41113670  수원시 권선구 권선1동
22  41113680  수원시 권선구 권선2동
23  41113690   수원시 권선구 곡선동
24  41113700   수원시 권선구 입북동
26  41115650   수원시 팔달구 매교동
27  41115660   수원시 팔달구 매산동
28  41115670   수원시 팔달구 고등동
29  41115680  수원시 팔달구 화서1동
30  41115690  수원시 팔달구 화서2동
31  41115700    수원시 팔달구 지동
32  41115710  수원시 팔달구 우만1동
33  41115720  수원시 팔달구 우만2동
34  41115730   수원시 팔달구 인계동
35  41115740   수원시 팔달구 행궁동
37  41117510  수원시 영통구 매탄1동
38  41117520  수원시 영통구 매탄2동
39  41117530  수원시 영통구 매탄3동
40  41117540  수원시 영통구 매탄4동
41  41117550   수원시 영통구 원천동
42  41117570  수원시 영통구 영통1동
43  41117580  수원시 영통구 영통2동
44  41117585  수원시 영통구 영통3동
45  41117593  수원시 영통구 망포1동
46  41117596  수원시 영통구 망포2동
47  41117600  수원시 영통구 광교1동
48  41117610  수원시 영통구 광교2동

In [11]:
code_sw_pd_num = code_sw_pd['행정동코드'].to_list()
code_sw_pd_num

[41115650,
 41115660,
 41115670,
 41115680,
 41115690,
 41115700,
 41115710,
 41115720,
 41115730,
 41115740]

## 수원 팔달구 데이터

In [19]:
sw_pd = df_23_25[df_23_25['admi_cty_no'].isin(code_sw_pd_num)]
sw_pd = sw_pd.reset_index(drop=True)
sw_pd

,ta_ymd,cty_rgn_no,admi_cty_no,card_tpbuz_cd,card_tpbuz_nm_1,card_tpbuz_nm_2,hour,sex,age,day,amt,cnt
0,20230101,41115,41115650,Q13,음식,커피/음료,1,F,6,7,14393,2
1,20230101,41115,41115650,Q13,음식,커피/음료,1,M,2,7,17678,2
2,20230101,41115,41115650,Q13,음식,커피/음료,1,M,3,7,17215,9
3,20230101,41115,41115650,Q13,음식,커피/음료,1,M,4,7,22685,6
4,20230101,41115,41115650,Q13,음식,커피/음료,1,M,5,7,23689,5
...,...,...,...,...,...,...,...,...,...,...,...,...
977156,20251031,41115,41115740,Q13,음식,커피/음료,9,M,7,5,31289,2
977157,20251031,41115,41115740,Q13,음식,커피/음료,10,F,3,5,78185,8
977158,20251031,41115,41115740,Q13,음식,커피/음료,10,F,4,5,1564,2
977159,20251031,41115,41115740,Q13,음식,커피/음료,10,F,6,5,105867,2
977160,20251031,41115,41115740,Q13,음식,커피/음료,10,M,4,5,75720,8

In [20]:
not_use = ['cty_rgn_no', 'card_tpbuz_cd', 'card_tpbuz_nm_1', 'card_tpbuz_nm_2']
sw_pd.drop(not_use, axis=1, inplace=True)
sw_pd

          ta_ymd  admi_cty_no  hour sex  age  day     amt  cnt
0       20230101     41115650     1   F    6    7   14393    2
1       20230101     41115650     1   M    2    7   17678    2
2       20230101     41115650     1   M    3    7   17215    9
3       20230101     41115650     1   M    4    7   22685    6
4       20230101     41115650     1   M    5    7   23689    5
...          ...          ...   ...  ..  ...  ...     ...  ...
977156  20251031     41115740     9   M    7    5   31289    2
977157  20251031     41115740    10   F    3    5   78185    8
977158  20251031     41115740    10   F    4    5    1564    2
977159  20251031     41115740    10   F    6    5  105867    2
977160  20251031     41115740    10   M    4    5   75720    8

[977161 rows x 8 columns]

In [5]:
sw_pd.columns = ['기준년월일', '행정동코드', '시간대', '성별', '연령별', '요일', '매출금액', '매출건수']
sw_pd.head(10)

      기준년월일     행정동코드  시간대 성별  연령별  요일   매출금액  매출건수
0  20230101  41115650    1  F    6   7  14393     2
1  20230101  41115650    1  M    2   7  17678     2
2  20230101  41115650    1  M    3   7  17215     9
3  20230101  41115650    1  M    4   7  22685     6
4  20230101  41115650    1  M    5   7  23689     5
5  20230101  41115650    1  M    6   7   5945     2
6  20230101  41115650    2  F    3   7   8917     2
7  20230101  41115650    2  M    4   7   5006     2
8  20230101  41115650    2  M    5   7  13924     2
9  20230101  41115650    2  M    6   7   7666     2

In [6]:
sw_pd_gender_sum = (sw_pd.groupby(['기준년월일', '행정동코드', '시간대', '연령별', '요일'], as_index=False)[['매출금액','매출건수']].sum())
sw_pd_gender_sum.head(10)

      기준년월일     행정동코드  시간대  연령별  요일    매출금액  매출건수
0  20230101  41115650    1    2   7   17678     2
1  20230101  41115650    1    3   7   17215     9
2  20230101  41115650    1    4   7   22685     6
3  20230101  41115650    1    5   7   23689     5
4  20230101  41115650    1    6   7   20338     4
5  20230101  41115650    2    3   7    8917     2
6  20230101  41115650    2    4   7    5006     2
7  20230101  41115650    2    5   7   13924     2
8  20230101  41115650    2    6   7    7666     2
9  20230101  41115650    3    4   7  146089    17

## 팔달구 데이터+행정동코드

In [9]:
code_name = code_sw_pd.set_index('행정동코드')['읍면동명']
code_name

행정동코드
41115650     매교동
41115660     매산동
41115670     고등동
41115680    화서1동
41115690    화서2동
41115700      지동
41115710    우만1동
41115720    우만2동
41115730     인계동
41115740     행궁동
Name: 읍면동명, dtype: object

In [33]:
sw_pd_gender_sum['행정동명'] = sw_pd_gender_sum['행정동코드'].map(code_name)
sw_pd_df = sw_pd_gender_sum.drop('행정동코드', axis=1)
sw_pd_df

           기준년월일  시간대  연령별  요일    매출금액  매출건수 행정동명
0       20230101    1    2   7   17678     2  매교동
1       20230101    1    3   7   17215     9  매교동
2       20230101    1    4   7   22685     6  매교동
3       20230101    1    5   7   23689     5  매교동
4       20230101    1    6   7   20338     4  매교동
...          ...  ...  ...  ..     ...   ...  ...
559482  20251031    9    6   5  276110    18  행궁동
559483  20251031    9    7   5   84726     7  행궁동
559484  20251031   10    3   5   78185     8  행궁동
559485  20251031   10    4   5   77284    10  행궁동
559486  20251031   10    6   5  105867     2  행궁동

[559487 rows x 7 columns]

In [64]:
sw_pd_df['객단가'] = pd.to_numeric((sw_pd_df['매출금액']/sw_pd_df['매출건수']).round(),errors='coerce').fillna(0).astype('int64')
sw_pd_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 559487 entries, 0 to 559486
Data columns (total 8 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   기준년월일   559487 non-null  int64
 1   시간대     559487 non-null  int64
 2   연령별     559487 non-null  int64
 3   요일      559487 non-null  int64
 4   매출금액    559487 non-null  int64
 5   매출건수    559487 non-null  int64
 6   행정동명    559487 non-null  object
 7   객단가     559487 non-null  int64
dtypes: int64(7), object(1)
memory usage: 34.1+ MB

In [68]:
sw_pd_df[sw_pd_df['매출금액']==0]

           기준년월일  시간대  연령별  요일  매출금액  매출건수  행정동명  객단가
196842  20240106    9    7   6     0     0  화서1동    0
205724  20240123    3    9   2     0     0  우만2동    0

In [86]:
sw_pd_df[sw_pd_df['객단가'].isnull()]

Empty DataFrame
Columns: [기준년월일, 시간대, 연령별, 요일, 매출금액, 매출건수, 행정동명, 객단가]
Index: []

In [71]:
sw_pd_df.drop([196842,205724], inplace=True)

           기준년월일  시간대  연령별  요일   매출금액  매출건수  행정동명   객단가
196841  20240106    9    6   6  15969     4  화서1동  3992
196843  20240106   10    3   6  16584     4  화서1동  4146
196844  20240106   10    4   6  20151     4  화서1동  5038

In [72]:
sw_pd_df = sw_pd_df.reset_index(drop=True)
sw_pd_df.iloc[196841:196843]

           기준년월일  시간대  연령별  요일   매출금액  매출건수  행정동명   객단가
196841  20240106    9    6   6  15969     4  화서1동  3992
196842  20240106   10    3   6  16584     4  화서1동  4146

In [211]:
sw_pd_df = (sw_pd_df.groupby(['기준년월일', '행정동명', '시간대', '요일'], as_index=False)[['연령별','매출금액','매출건수']].sum())
sw_pd_df['객단가'] = pd.to_numeric((sw_pd_df['매출금액']/sw_pd_df['매출건수']).round(),errors='coerce').fillna(0).astype('int64')
sw_pd_df.drop('연령별', axis=1, inplace=True)
sw_pd_df

           기준년월일  행정동명  시간대  요일     매출금액  매출건수    객단가
0       20230101   고등동    1   7    65063     7   9295
1       20230101   고등동    2   7    14878     4   3720
2       20230101   고등동    3   7    77671    20   3884
3       20230101   고등동    4   7   452897    52   8710
4       20230101   고등동    5   7   972179    92  10567
...          ...   ...  ...  ..      ...   ...    ...
101508  20251031  화서2동    6   5   886440   155   5719
101509  20251031  화서2동    7   5  1319747   105  12569
101510  20251031  화서2동    8   5  3662364   125  29299
101511  20251031  화서2동    9   5  1999679    51  39209
101512  20251031  화서2동   10   5    33534    11   3049

[101513 rows x 7 columns]

## 수원시 팔달구 배달데이터

In [43]:
df_23_1 = df_23_1[df_23_1['card_tpbuz_nm_2']=='음식배달서비스']
df_23_2 = df_23_2[df_23_2['card_tpbuz_nm_2']=='음식배달서비스']
df_23 = pd.concat([df_23_1, df_23_2]).reset_index(drop=True)
df_24_1 = df_24_1[df_24_1['card_tpbuz_nm_2']=='음식배달서비스']
df_24_2 = df_24_2[df_24_2['card_tpbuz_nm_2']=='음식배달서비스']
df_24_3 = df_24_3[df_24_3['card_tpbuz_nm_2']=='음식배달서비스']
df_24 = pd.concat([df_24_1, df_24_2, df_24_3]).reset_index(drop=True)
df_25_1 = df_25_1[df_25_1['card_tpbuz_nm_2']=='음식배달서비스']
df_25_2 = df_25_2[df_25_2['card_tpbuz_nm_2']=='음식배달서비스']
df_25 = pd.concat([df_25_1, df_25_2]).reset_index(drop=True)
df_23_25 = pd.concat([df_23, df_24, df_25]).reset_index(drop=True)
df_23_25

,ta_ymd,cty_rgn_no,admi_cty_no,card_tpbuz_cd,card_tpbuz_nm_1,card_tpbuz_nm_2,hour,sex,age,day,amt,cnt
0,20230101,41111,41111573,Q09,음식,음식배달서비스,1,F,3,7,150929,2
1,20230101,41111,41111573,Q09,음식,음식배달서비스,1,F,6,7,83591,2
2,20230101,41111,41111573,Q09,음식,음식배달서비스,1,M,3,7,406192,8
3,20230101,41111,41111573,Q09,음식,음식배달서비스,1,M,6,7,219009,3
4,20230101,41111,41111573,Q09,음식,음식배달서비스,9,M,3,7,109133,3
...,...,...,...,...,...,...,...,...,...,...,...,...
64810,20251031,41117,41117610,Q09,음식,음식배달서비스,5,F,5,5,10062,2
64811,20251031,41117,41117610,Q09,음식,음식배달서비스,5,M,5,5,20929,2
64812,20251031,41117,41117610,Q09,음식,음식배달서비스,5,M,6,5,6656,2
64813,20251031,41117,41117610,Q09,음식,음식배달서비스,6,F,3,5,247678,2
64814,20251031,41117,41117610,Q09,음식,음식배달서비스,7,F,5,5,11146,2

In [34]:
sw_del = df_23_25[df_23_25['admi_cty_no'].isin(code_sw_pd_num)]
sw_del = sw_del.reset_index(drop=True)
not_use = ['cty_rgn_no', 'card_tpbuz_cd', 'card_tpbuz_nm_1', 'card_tpbuz_nm_2']
sw_del.drop(not_use, axis=1, inplace=True)
sw_del

         ta_ymd  admi_cty_no  hour sex  age  day     amt  cnt
0      20230101     41115730     1   M    3    7   12384    2
1      20230101     41115730     1   M    5    7   44458    5
2      20230101     41115730     5   F    6    7   23220    2
3      20230101     41115730     6   F    4    7   22446    2
4      20230101     41115730     6   M    3    7   21672    2
...         ...          ...   ...  ..  ...  ...     ...  ...
14413  20251031     41115730     9   M    4    5   23884    2
14414  20251031     41115730    10   F    4    5   25697    2
14415  20251031     41115730    10   M    4    5  409272    5
14416  20251031     41115730    10   M    5    5   27090    2
14417  20251031     41115730    10   M    6    5   61920    2

[14418 rows x 8 columns]

In [35]:
sw_del.columns = ['기준년월일', '행정동코드', '시간대', '성별', '연령별', '요일', '매출금액', '매출건수']
sw_del_sum = (sw_del.groupby(['기준년월일', '행정동코드', '시간대', '요일'], as_index=False)[['매출금액','매출건수']].sum())
sw_del_sum

         기준년월일     행정동코드  시간대  요일    매출금액  매출건수
0     20230101  41115730    1   7   56842     7
1     20230101  41115730    5   7   23220     2
2     20230101  41115730    6   7   44118     4
3     20230101  41115730    8   7   71827     4
4     20230102  41115730    1   1   26316     4
...        ...       ...  ...  ..     ...   ...
6886  20251031  41115730    6   5   41641     6
6887  20251031  41115730    7   5   59907     4
6888  20251031  41115730    8   5   44636     5
6889  20251031  41115730    9   5  108311     4
6890  20251031  41115730   10   5  523979    11

[6891 rows x 6 columns]

In [36]:
sw_del_sum['행정동명'] = sw_del_sum['행정동코드'].map(code_name)
sw_del_sum = sw_del_sum.drop('행정동코드', axis=1)
sw_del_sum

         기준년월일  시간대  요일    매출금액  매출건수 행정동명
0     20230101    1   7   56842     7  인계동
1     20230101    5   7   23220     2  인계동
2     20230101    6   7   44118     4  인계동
3     20230101    8   7   71827     4  인계동
4     20230102    1   1   26316     4  인계동
...        ...  ...  ..     ...   ...  ...
6886  20251031    6   5   41641     6  인계동
6887  20251031    7   5   59907     4  인계동
6888  20251031    8   5   44636     5  인계동
6889  20251031    9   5  108311     4  인계동
6890  20251031   10   5  523979    11  인계동

[6891 rows x 6 columns]

In [37]:
sw_del_sum['객단가'] = pd.to_numeric((sw_del_sum['매출금액']/sw_del_sum['매출건수']).round(),errors='coerce').fillna(0).astype('int64')
sw_del_sum

         기준년월일  시간대  요일    매출금액  매출건수 행정동명    객단가
0     20230101    1   7   56842     7  인계동   8120
1     20230101    5   7   23220     2  인계동  11610
2     20230101    6   7   44118     4  인계동  11030
3     20230101    8   7   71827     4  인계동  17957
4     20230102    1   1   26316     4  인계동   6579
...        ...  ...  ..     ...   ...  ...    ...
6886  20251031    6   5   41641     6  인계동   6940
6887  20251031    7   5   59907     4  인계동  14977
6888  20251031    8   5   44636     5  인계동   8927
6889  20251031    9   5  108311     4  인계동  27078
6890  20251031   10   5  523979    11  인계동  47634

[6891 rows x 7 columns]

In [38]:
sw_del_sum = sw_del_sum[['기준년월일','시간대','요일','행정동명','매출금액','매출건수','객단가']]
sw_del_sum.columns = ['TA_YMD','HOUR','DAY','DONG','AMT_D','CNT_D','UNIT_D']
sw_del_sum

        TA_YMD  HOUR  DAY DONG   AMT_D  CNT_D  UNIT_D
0     20230101     1    7  인계동   56842      7    8120
1     20230101     5    7  인계동   23220      2   11610
2     20230101     6    7  인계동   44118      4   11030
3     20230101     8    7  인계동   71827      4   17957
4     20230102     1    1  인계동   26316      4    6579
...        ...   ...  ...  ...     ...    ...     ...
6886  20251031     6    5  인계동   41641      6    6940
6887  20251031     7    5  인계동   59907      4   14977
6888  20251031     8    5  인계동   44636      5    8927
6889  20251031     9    5  인계동  108311      4   27078
6890  20251031    10    5  인계동  523979     11   47634

[6891 rows x 7 columns]

## 수원 배달 데이터

In [62]:
sw_delivery = df_23_25.drop(['cty_rgn_no','card_tpbuz_cd', 'card_tpbuz_nm_1', 'card_tpbuz_nm_2'], axis=1)
sw_delivery.columns = ['TA_YMD', 'DONG', 'HOUR','sex','age','DAY', 'AMT', 'CNT']
sw_delivery = sw_delivery.groupby(['TA_YMD', 'DONG', 'HOUR','DAY'], as_index=False)[['AMT','CNT']].sum()
sw_delivery

         TA_YMD      DONG  HOUR  DAY      AMT  CNT
0      20230101  41111573     1    7   859721   15
1      20230101  41111573     9    7   109133    3
2      20230101  41111580     7    7    37152    2
3      20230101  41111580     8    7    31455    2
4      20230101  41111580     9    7    18576    2
...         ...       ...   ...  ...      ...  ...
37761  20251031  41117600    10    5  2359488    5
37762  20251031  41117610     4    5   270898    2
37763  20251031  41117610     5    5    37647    6
37764  20251031  41117610     6    5   247678    2
37765  20251031  41117610     7    5    11146    2

[37766 rows x 6 columns]

In [58]:
sw_code = code_sw.set_index('행정동코드')['시군구명']

In [63]:
sw_delivery['DONG'] = sw_delivery['DONG'].map(sw_code)
sw_delivery['UNIT'] = pd.to_numeric((sw_delivery['AMT']/sw_delivery['CNT']).round(), errors='coerce').fillna(0).astype('int64')
sw_delivery

         TA_YMD          DONG  HOUR  DAY      AMT  CNT    UNIT
0      20230101  수원시 장안구 정자3동     1    7   859721   15   57315
1      20230101  수원시 장안구 정자3동     9    7   109133    3   36378
2      20230101   수원시 장안구 영화동     7    7    37152    2   18576
3      20230101   수원시 장안구 영화동     8    7    31455    2   15728
4      20230101   수원시 장안구 영화동     9    7    18576    2    9288
...         ...           ...   ...  ...      ...  ...     ...
37761  20251031  수원시 영통구 광교1동    10    5  2359488    5  471898
37762  20251031  수원시 영통구 광교2동     4    5   270898    2  135449
37763  20251031  수원시 영통구 광교2동     5    5    37647    6    6274
37764  20251031  수원시 영통구 광교2동     6    5   247678    2  123839
37765  20251031  수원시 영통구 광교2동     7    5    11146    2    5573

[37766 rows x 7 columns]

## 종합

In [29]:
sw_data_sum

          TA_YMD  HOUR  DAY  DONG      AMT  CNT   UNIT   TEMP  RAIN
0       20230101     1    7   고등동    65063    7   9295   2.10   0.0
1       20230101     2    7   고등동    14878    4   3720  -0.20   0.0
2       20230101     3    7   고등동    77671   20   3884  -2.25   0.0
3       20230101     4    7   고등동   452897   52   8710  -3.20   0.0
4       20230101     5    7   고등동   972179   92  10567  -4.10   0.0
...          ...   ...  ...   ...      ...  ...    ...    ...   ...
101508  20251031     6    5  화서2동   886440  155   5719  11.65   1.5
101509  20251031     7    5  화서2동  1319747  105  12569  11.65   0.0
101510  20251031     8    5  화서2동  3662364  125  29299  10.70   0.0
101511  20251031     9    5  화서2동  1999679   51  39209   9.35   0.0
101512  20251031    10    5  화서2동    33534   11   3049  12.00   0.0

[101513 rows x 9 columns]

In [40]:
sw_merged = pd.merge(sw_data_sum, sw_del_sum, on=['TA_YMD', 'HOUR', 'DAY', 'DONG'], how='left')
sw_merged

,TA_YMD,HOUR,DAY,DONG,AMT,CNT,UNIT,TEMP,RAIN,AMT_D,CNT_D,UNIT_D
0,20230101,1,7,고등동,65063,7,9295,2.10,0.0,NaN,NaN,NaN
1,20230101,2,7,고등동,14878,4,3720,-0.20,0.0,NaN,NaN,NaN
2,20230101,3,7,고등동,77671,20,3884,-2.25,0.0,NaN,NaN,NaN
3,20230101,4,7,고등동,452897,52,8710,-3.20,0.0,NaN,NaN,NaN
4,20230101,5,7,고등동,972179,92,10567,-4.10,0.0,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
101508,20251031,6,5,화서2동,886440,155,5719,11.65,1.5,NaN,NaN,NaN
101509,20251031,7,5,화서2동,1319747,105,12569,11.65,0.0,NaN,NaN,NaN
101510,20251031,8,5,화서2동,3662364,125,29299,10.70,0.0,NaN,NaN,NaN
101511,20251031,9,5,화서2동,1999679,51,39209,9.35,0.0,NaN,NaN,NaN
101512,20251031,10,5,화서2동,33534,11,3049,12.00,0.0,NaN,NaN,NaN

In [51]:
sw_merged = sw_merged.fillna(0)
sw_merged[['AMT_D', 'CNT_D', 'UNIT_D']] = sw_merged[['AMT_D', 'CNT_D', 'UNIT_D']].astype('int64')
sw_merged

,TA_YMD,HOUR,DAY,DONG,AMT,CNT,UNIT,TEMP,RAIN,AMT_D,CNT_D,UNIT_D
0,20230101,1,7,고등동,65063,7,9295,2.10,0.0,0,0,0
1,20230101,2,7,고등동,14878,4,3720,-0.20,0.0,0,0,0
2,20230101,3,7,고등동,77671,20,3884,-2.25,0.0,0,0,0
3,20230101,4,7,고등동,452897,52,8710,-3.20,0.0,0,0,0
4,20230101,5,7,고등동,972179,92,10567,-4.10,0.0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...
101508,20251031,6,5,화서2동,886440,155,5719,11.65,1.5,0,0,0
101509,20251031,7,5,화서2동,1319747,105,12569,11.65,0.0,0,0,0
101510,20251031,8,5,화서2동,3662364,125,29299,10.70,0.0,0,0,0
101511,20251031,9,5,화서2동,1999679,51,39209,9.35,0.0,0,0,0
101512,20251031,10,5,화서2동,33534,11,3049,12.00,0.0,0,0,0

In [52]:
sw_merged.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 101513 entries, 0 to 101512
Data columns (total 12 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   TA_YMD  101513 non-null  int64
 1   HOUR    101513 non-null  int64
 2   DAY     101513 non-null  int64
 3   DONG    101513 non-null  object
 4   AMT     101513 non-null  int64
 5   CNT     101513 non-null  int64
 6   UNIT    101513 non-null  int64
 7   TEMP    101513 non-null  float64
 8   RAIN    101513 non-null  float64
 9   AMT_D   101513 non-null  int64
 10  CNT_D   101513 non-null  int64
 11  UNIT_D  101513 non-null  int64
dtypes: float64(2), int64(9), object(1)
memory usage: 10.1+ MB

In [54]:
sw_merged[sw_merged['AMT_D'] != 0]

,TA_YMD,HOUR,DAY,DONG,AMT,CNT,UNIT,TEMP,RAIN,AMT_D,CNT_D,UNIT_D
49,20230101,1,7,인계동,18458267,600,30764,2.10,0.0,56842,7,8120
53,20230101,5,7,인계동,8272080,707,11700,-4.10,0.0,23220,2,11610
54,20230101,6,7,인계동,6159812,589,10458,-5.35,0.0,44118,4,11030
56,20230101,8,7,인계동,6339723,453,13995,-7.00,0.0,71827,4,17957
144,20230102,1,1,인계동,2913467,130,22411,-2.89,0.0,26316,4,6579
...,...,...,...,...,...,...,...,...,...,...,...,...
101468,20251031,6,5,인계동,5967868,681,8763,11.65,1.5,41641,6,6940
101469,20251031,7,5,인계동,5050237,603,8375,11.65,0.0,59907,4,14977
101470,20251031,8,5,인계동,10422869,736,14162,10.70,0.0,44636,5,8927
101471,20251031,9,5,인계동,8277529,527,15707,9.35,0.0,108311,4,27078
101472,20251031,10,5,인계동,3952549,143,27640,12.00,0.0,523979,11,47634

## 음식전체

In [27]:
df_23_1 = df_23_1[df_23_1['card_tpbuz_nm_1']=='음식']
df_23_2 = df_23_2[df_23_2['card_tpbuz_nm_1']=='음식']
df_23 = pd.concat([df_23_1, df_23_2]).reset_index(drop=True)
df_24_1 = df_24_1[df_24_1['card_tpbuz_nm_1']=='음식']
df_24_2 = df_24_2[df_24_2['card_tpbuz_nm_1']=='음식']
df_24_3 = df_24_3[df_24_3['card_tpbuz_nm_1']=='음식']
df_24 = pd.concat([df_24_1, df_24_2, df_24_3]).reset_index(drop=True)
df_25_1 = df_25_1[df_25_1['card_tpbuz_nm_1']=='음식']
df_25_2 = df_25_2[df_25_2['card_tpbuz_nm_1']=='음식']
df_25 = pd.concat([df_25_1, df_25_2]).reset_index(drop=True)
df_23_25 = pd.concat([df_23, df_24, df_25]).reset_index(drop=True)

sw_food = df_23_25[df_23_25['admi_cty_no'].isin(code_sw_pd_num)]
sw_food = sw_food.reset_index(drop=True)
not_use = ['cty_rgn_no', 'card_tpbuz_cd', 'card_tpbuz_nm_1']
sw_food.drop(not_use, axis=1, inplace=True)

sw_food

,ta_ymd,admi_cty_no,card_tpbuz_nm_2,hour,sex,age,day,amt,cnt
0,20230101,41115650,간이주점,1,F,3,7,33562,2
1,20230101,41115650,간이주점,1,F,4,7,173913,3
2,20230101,41115650,간이주점,1,M,3,7,389565,3
3,20230101,41115650,간이주점,1,M,5,7,207475,3
4,20230101,41115650,간이주점,10,F,4,7,55896,2
...,...,...,...,...,...,...,...,...,...
7723128,20251031,41115740,한식,10,F,5,5,157872,3
7723129,20251031,41115740,한식,10,F,7,5,74627,2
7723130,20251031,41115740,한식,10,M,3,5,408941,10
7723131,20251031,41115740,한식,10,M,4,5,248101,6
7723132,20251031,41115740,한식,10,M,7,5,23817,2

In [28]:
sw_food.columns = ['기준년월일', '행정동코드', '업종', '시간대', '성별', '연령별', '요일', '매출금액', '매출건수']
sw_food_sum = (sw_food.groupby(['기준년월일', '행정동코드', '업종', '시간대', '요일'], as_index=False)[['매출금액','매출건수']].sum())
sw_food_sum

            기준년월일     행정동코드    업종  시간대  요일      매출금액  매출건수
0        20230101  41115650  간이주점    1   7    804515    11
1        20230101  41115650  간이주점   10   7     55896     2
2        20230101  41115650  고기요리    3   7     12189     2
3        20230101  41115650  고기요리    4   7    130597     4
4        20230101  41115650  고기요리    5   7     77736     8
...           ...       ...   ...  ...  ..       ...   ...
1075175  20251031  41115740    한식    6   5  15893169   673
1075176  20251031  41115740    한식    7   5  19665343   691
1075177  20251031  41115740    한식    8   5  23620407   680
1075178  20251031  41115740    한식    9   5  10156390   243
1075179  20251031  41115740    한식   10   5   1907528    38

[1075180 rows x 7 columns]

In [39]:
sw_food_temp_sum = pd.merge(sw_food_sum, sw_temp_group, on=['기준년월일', '시간대'], how='left')
sw_food_temp_sum = pd.merge(sw_food_temp_sum, sw_rainfall_group, on=['기준년월일', '시간대'], how='left')
sw_food_temp_sum = sw_food_temp_sum.fillna(0)
sw_food_temp_sum

            기준년월일     행정동코드    업종  시간대  요일      매출금액  매출건수     기온  강수량
0        20230101  41115650  간이주점    1   7    804515    11   2.10  0.0
1        20230101  41115650  간이주점   10   7     55896     2  -5.90  0.0
2        20230101  41115650  고기요리    3   7     12189     2  -2.25  0.0
3        20230101  41115650  고기요리    4   7    130597     4  -3.20  0.0
4        20230101  41115650  고기요리    5   7     77736     8  -4.10  0.0
...           ...       ...   ...  ...  ..       ...   ...    ...  ...
1075175  20251031  41115740    한식    6   5  15893169   673  11.65  1.5
1075176  20251031  41115740    한식    7   5  19665343   691  11.65  0.0
1075177  20251031  41115740    한식    8   5  23620407   680  10.70  0.0
1075178  20251031  41115740    한식    9   5  10156390   243   9.35  0.0
1075179  20251031  41115740    한식   10   5   1907528    38  12.00  0.0

[1075180 rows x 9 columns]

In [40]:
sw_food_temp_sum['행정동명'] = sw_food_temp_sum['행정동코드'].map(code_name)
sw_food_temp_sum = sw_food_temp_sum.drop('행정동코드', axis=1)
sw_food_temp_sum['객단가'] = pd.to_numeric((sw_food_temp_sum['매출금액']/sw_food_temp_sum['매출건수']).round(),errors='coerce').fillna(0).astype('int64')

sw_food_temp_sum = sw_food_temp_sum[['기준년월일','시간대','요일','행정동명','업종','매출금액','매출건수','객단가','기온', '강수량']]
sw_food_temp_sum.columns = ['TA_YMD','HOUR','DAY','DONG','TYPE','AMT','CNT','UNIT','TEMP', 'RAIN']

sw_food_temp_sum

           TA_YMD  HOUR  DAY DONG  TYPE       AMT  CNT   UNIT   TEMP  RAIN
0        20230101     1    7  매교동  간이주점    804515   11  73138   2.10   0.0
1        20230101    10    7  매교동  간이주점     55896    2  27948  -5.90   0.0
2        20230101     3    7  매교동  고기요리     12189    2   6094  -2.25   0.0
3        20230101     4    7  매교동  고기요리    130597    4  32649  -3.20   0.0
4        20230101     5    7  매교동  고기요리     77736    8   9717  -4.10   0.0
...           ...   ...  ...  ...   ...       ...  ...    ...    ...   ...
1075175  20251031     6    5  행궁동    한식  15893169  673  23615  11.65   1.5
1075176  20251031     7    5  행궁동    한식  19665343  691  28459  11.65   0.0
1075177  20251031     8    5  행궁동    한식  23620407  680  34736  10.70   0.0
1075178  20251031     9    5  행궁동    한식  10156390  243  41796   9.35   0.0
1075179  20251031    10    5  행궁동    한식   1907528   38  50198  12.00   0.0

[1075180 rows x 10 columns]

## 배달, 한식

In [5]:
df_23_1 = df_23_1[df_23_1['card_tpbuz_nm_1']=='음식']
df_23_2 = df_23_2[df_23_2['card_tpbuz_nm_1']=='음식']
df_23 = pd.concat([df_23_1, df_23_2]).reset_index(drop=True)
df_24_1 = df_24_1[df_24_1['card_tpbuz_nm_1']=='음식']
df_24_2 = df_24_2[df_24_2['card_tpbuz_nm_1']=='음식']
df_24_3 = df_24_3[df_24_3['card_tpbuz_nm_1']=='음식']
df_24 = pd.concat([df_24_1, df_24_2, df_24_3]).reset_index(drop=True)
df_25_1 = df_25_1[df_25_1['card_tpbuz_nm_1']=='음식']
df_25_2 = df_25_2[df_25_2['card_tpbuz_nm_1']=='음식']
df_25 = pd.concat([df_25_1, df_25_2]).reset_index(drop=True)
df_23_25 = pd.concat([df_23, df_24, df_25]).reset_index(drop=True)
df_23_25

,ta_ymd,cty_rgn_no,admi_cty_no,card_tpbuz_cd,card_tpbuz_nm_1,card_tpbuz_nm_2,hour,sex,age,day,amt,cnt
0,20230101,41111,41111560,Q01,음식,간이주점,1,F,4,7,3814,2
1,20230101,41111,41111560,Q01,음식,간이주점,1,F,9,7,228833,2
2,20230101,41111,41111560,Q01,음식,간이주점,1,M,3,7,173303,2
3,20230101,41111,41111560,Q01,음식,간이주점,1,M,4,7,83905,2
4,20230101,41111,41111560,Q01,음식,간이주점,1,M,5,7,54920,2
...,...,...,...,...,...,...,...,...,...,...,...,...
32264960,20251031,41117,41117610,Q16,음식,휴게소/대형업체,5,M,5,5,17972,2
32264961,20251031,41117,41117610,Q16,음식,휴게소/대형업체,5,M,6,5,73372,5
32264962,20251031,41117,41117610,Q16,음식,휴게소/대형업체,6,M,6,5,18800,3
32264963,20251031,41117,41117610,Q16,음식,휴게소/대형업체,7,F,6,5,17972,2
32264964,20251031,41117,41117610,Q16,음식,휴게소/대형업체,7,M,6,5,11794,2

In [6]:
sw_food_data = df_23_25.drop(['cty_rgn_no','card_tpbuz_cd','card_tpbuz_nm_1'], axis=1)
sw_food_data.columns = ['TA_YMD', 'DONG', 'TYPE', 'HOUR','SEX','AGE','DAY','AMT','CNT']
sw_food_data = sw_food_data.groupby(['TA_YMD','DONG','TYPE','HOUR','DAY'],as_index=False)[['AMT','CNT']].sum()
sw_food_data

            TA_YMD      DONG      TYPE  HOUR SEX  AGE  DAY     AMT  CNT
0         20230101  41111560      간이주점     1   F    4    7    3814    2
1         20230101  41111560      간이주점     1   F    9    7  228833    2
2         20230101  41111560      간이주점     1   M    3    7  173303    2
3         20230101  41111560      간이주점     1   M    4    7   83905    2
4         20230101  41111560      간이주점     1   M    5    7   54920    2
...            ...       ...       ...   ...  ..  ...  ...     ...  ...
32264960  20251031  41117610  휴게소/대형업체     5   M    5    5   17972    2
32264961  20251031  41117610  휴게소/대형업체     5   M    6    5   73372    5
32264962  20251031  41117610  휴게소/대형업체     6   M    6    5   18800    3
32264963  20251031  41117610  휴게소/대형업체     7   F    6    5   17972    2
32264964  20251031  41117610  휴게소/대형업체     7   M    6    5   11794    2

[32264965 rows x 9 columns]

In [19]:
sw_delivery = sw_food_data[sw_food_data['TYPE']=='음식배달서비스'].reset_index(drop=True)
sw_delivery

         TA_YMD      DONG     TYPE  HOUR  DAY      AMT  CNT
0      20230101  41111573  음식배달서비스     1    7   859721   15
1      20230101  41111573  음식배달서비스     9    7   109133    3
2      20230101  41111580  음식배달서비스     7    7    37152    2
3      20230101  41111580  음식배달서비스     8    7    31455    2
4      20230101  41111580  음식배달서비스     9    7    18576    2
...         ...       ...      ...   ...  ...      ...  ...
37761  20251031  41117600  음식배달서비스    10    5  2359488    5
37762  20251031  41117610  음식배달서비스     4    5   270898    2
37763  20251031  41117610  음식배달서비스     5    5    37647    6
37764  20251031  41117610  음식배달서비스     6    5   247678    2
37765  20251031  41117610  음식배달서비스     7    5    11146    2

[37766 rows x 7 columns]

In [20]:
sw_koreanfood = sw_food_data[sw_food_data['TYPE']=='한식'].reset_index(drop=True)
sw_koreanfood

          TA_YMD      DONG TYPE  HOUR  DAY       AMT  CNT
0       20230101  41111560   한식     1    7    987830   17
1       20230101  41111560   한식     2    7    516279   20
2       20230101  41111560   한식     3    7   2220711   76
3       20230101  41111560   한식     4    7   9419194  230
4       20230101  41111560   한식     5    7  17829061  364
...          ...       ...  ...   ...  ...       ...  ...
443518  20251031  41117610   한식     6    5   1624413  106
443519  20251031  41117610   한식     7    5   6841204  185
443520  20251031  41117610   한식     8    5  10899392  188
443521  20251031  41117610   한식     9    5   4432221   62
443522  20251031  41117610   한식    10    5    828374   17

[443523 rows x 7 columns]

In [38]:
sw_code = code_sw.set_index('행정동코드')['시군구명']

In [21]:
sw_delivery['DONG'] = sw_delivery['DONG'].map(sw_code)
sw_delivery['UNIT'] = pd.to_numeric((sw_delivery['AMT']/sw_delivery['CNT']).round(), errors='coerce').fillna(0).astype('int64')
sw_delivery

         TA_YMD          DONG     TYPE  HOUR  DAY      AMT  CNT    UNIT
0      20230101  수원시 장안구 정자3동  음식배달서비스     1    7   859721   15   57315
1      20230101  수원시 장안구 정자3동  음식배달서비스     9    7   109133    3   36378
2      20230101   수원시 장안구 영화동  음식배달서비스     7    7    37152    2   18576
3      20230101   수원시 장안구 영화동  음식배달서비스     8    7    31455    2   15728
4      20230101   수원시 장안구 영화동  음식배달서비스     9    7    18576    2    9288
...         ...           ...      ...   ...  ...      ...  ...     ...
37761  20251031  수원시 영통구 광교1동  음식배달서비스    10    5  2359488    5  471898
37762  20251031  수원시 영통구 광교2동  음식배달서비스     4    5   270898    2  135449
37763  20251031  수원시 영통구 광교2동  음식배달서비스     5    5    37647    6    6274
37764  20251031  수원시 영통구 광교2동  음식배달서비스     6    5   247678    2  123839
37765  20251031  수원시 영통구 광교2동  음식배달서비스     7    5    11146    2    5573

[37766 rows x 8 columns]

In [22]:
sw_koreanfood['DONG'] = sw_koreanfood['DONG'].map(sw_code)
sw_koreanfood['UNIT'] = pd.to_numeric((sw_koreanfood['AMT']/sw_koreanfood['CNT']).round(), errors='coerce').fillna(0).astype('int64')
sw_koreanfood

          TA_YMD          DONG TYPE  HOUR  DAY       AMT  CNT   UNIT
0       20230101   수원시 장안구 파장동   한식     1    7    987830   17  58108
1       20230101   수원시 장안구 파장동   한식     2    7    516279   20  25814
2       20230101   수원시 장안구 파장동   한식     3    7   2220711   76  29220
3       20230101   수원시 장안구 파장동   한식     4    7   9419194  230  40953
4       20230101   수원시 장안구 파장동   한식     5    7  17829061  364  48981
...          ...           ...  ...   ...  ...       ...  ...    ...
443518  20251031  수원시 영통구 광교2동   한식     6    5   1624413  106  15325
443519  20251031  수원시 영통구 광교2동   한식     7    5   6841204  185  36979
443520  20251031  수원시 영통구 광교2동   한식     8    5  10899392  188  57975
443521  20251031  수원시 영통구 광교2동   한식     9    5   4432221   62  71487
443522  20251031  수원시 영통구 광교2동   한식    10    5    828374   17  48728

[443523 rows x 8 columns]

In [4]:
sw_delivery.drop('TYPE', inplace=True, axis=1)
sw_koreanfood.drop('TYPE', inplace=True, axis=1)

In [8]:
sw_delivery[sw_delivery['AMT'].isna()]

Empty DataFrame
Columns: [TA_YMD, DONG, HOUR, DAY, AMT, CNT, UNIT]
Index: []

## 휴게소, 빵집

In [39]:
sw_rest = sw_food_data[sw_food_data['TYPE']=='휴게소/대형업체']
sw_rest.drop('TYPE', inplace=True, axis=1)
sw_rest.reset_index(drop=True, inplace=True)
sw_rest['DONG'] = sw_rest['DONG'].map(sw_code)
sw_rest['UNIT'] = pd.to_numeric((sw_rest['AMT']/sw_rest['CNT']).round(), errors='coerce').fillna(0).astype('int64')
sw_rest

C:\Users\Admin\AppData\Local\Temp\ipykernel_10336\1159208788.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sw_rest.drop('TYPE', inplace=True, axis=1)
C:\Users\Admin\AppData\Local\Temp\ipykernel_10336\1159208788.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sw_rest['DONG'] = sw_rest['DONG'].map(sw_code)
C:\Users\Admin\AppData\Local\Temp\ipykernel_10336\1159208788.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sw_rest['UNIT'] = pd.to_numeric((sw_rest['AMT']/sw_rest['CNT']).round(), errors='coerce').fillna(0).astype('int64')

         TA_YMD          DONG  HOUR  DAY     AMT  CNT   UNIT
0      20230101  수원시 권선구 권선2동     4    7   16633    4   4158
1      20230101  수원시 권선구 권선2동     6    7    7740    2   3870
2      20230101   수원시 팔달구 인계동     2    7   15588    2   7794
3      20230101   수원시 팔달구 인계동     3    7   92770   14   6626
4      20230101   수원시 팔달구 인계동     4    7   51548    9   5728
...         ...           ...   ...  ...     ...  ...    ...
45749  20251031  수원시 영통구 광교2동     3    5   29954    2  14977
45750  20251031  수원시 영통구 광교2동     4    5  637817   59  10810
45751  20251031  수원시 영통구 광교2동     5    5  452522   38  11908
45752  20251031  수원시 영통구 광교2동     6    5   18800    3   6267
45753  20251031  수원시 영통구 광교2동     7    5   29766    4   7442

[45754 rows x 7 columns]

In [40]:
sw_bakery = sw_food_data[sw_food_data['TYPE']=='제과/제빵/떡/케익']
sw_bakery.drop('TYPE', inplace=True, axis=1)
sw_bakery.reset_index(drop=True, inplace=True)
sw_bakery['DONG'] = sw_bakery['DONG'].map(sw_code)
sw_bakery['UNIT'] = pd.to_numeric((sw_bakery['AMT']/sw_bakery['CNT']).round(), errors='coerce').fillna(0).astype('int64')
sw_bakery

C:\Users\Admin\AppData\Local\Temp\ipykernel_10336\2395808283.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sw_bakery.drop('TYPE', inplace=True, axis=1)
C:\Users\Admin\AppData\Local\Temp\ipykernel_10336\2395808283.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sw_bakery['DONG'] = sw_bakery['DONG'].map(sw_code)
C:\Users\Admin\AppData\Local\Temp\ipykernel_10336\2395808283.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sw_bakery['UNIT'] = pd.to_numeric((sw_bakery['AMT']/sw_bakery['CNT']).round(), errors='coerce').fillna(0).astype('int64')

          TA_YMD          DONG  HOUR  DAY      AMT  CNT   UNIT
0       20230101   수원시 장안구 파장동     2    7   104027    8  13003
1       20230101   수원시 장안구 파장동     3    7  1514656   93  16287
2       20230101   수원시 장안구 파장동     4    7  3275213  122  26846
3       20230101   수원시 장안구 파장동     5    7  5897657  230  25642
4       20230101   수원시 장안구 파장동     6    7  5514490  234  23566
...          ...           ...   ...  ...      ...  ...    ...
409938  20251031  수원시 영통구 광교2동     6    5   969515   90  10772
409939  20251031  수원시 영통구 광교2동     7    5   836033   68  12295
409940  20251031  수원시 영통구 광교2동     8    5   471121   47  10024
409941  20251031  수원시 영통구 광교2동     9    5   137847   11  12532
409942  20251031  수원시 영통구 광교2동    10    5     5875    2   2938

[409943 rows x 7 columns]

# 기상청

In [227]:
sw_weather = pd.read_csv('C:/Users/Admin/AI/downloads/카드소비데이터 수원시/수원_기상_20251222142454.csv', encoding='cp949')
sw_weather.drop(['지점', '지점명'], axis=1, inplace=True)
sw_weather

            일시  평균기온(°C)  일강수량(mm)  합계 3시간 신적설(cm)
0   2023-01-01      -2.1       NaN             NaN
1   2023-01-02      -5.6       NaN             NaN
2   2023-01-03      -6.3       NaN             NaN
3   2023-01-04      -3.1       NaN             NaN
4   2023-01-05      -3.6       NaN             NaN
5   2023-01-06      -0.9       5.5             NaN
6   2023-01-07       0.5       0.1             NaN
7   2023-01-08       0.2       NaN             NaN
8   2023-01-09       2.3       NaN             NaN
9   2023-01-10      -0.2       NaN             NaN
10  2023-01-11       0.2       NaN             NaN
11  2023-01-12       4.7       0.1             NaN
12  2023-01-13       7.1      25.2             NaN
13  2023-01-14       4.9       3.7             NaN
14  2023-01-15      -1.5       2.3             0.9
15  2023-01-16      -5.2       0.0             0.0
16  2023-01-17      -3.0       0.0             NaN
17  2023-01-18      -2.1       NaN             NaN
18  2023-01-19      -0.1       0.7             NaN
19  2023-01-20      -2.4       NaN             NaN
20  2023-01-21      -4.0       NaN             NaN
21  2023-01-22      -0.1       NaN             NaN
22  2023-01-23      -0.5       NaN             NaN
23  2023-01-24     -13.4       0.0             NaN
24  2023-01-25     -10.8       NaN             NaN
25  2023-01-26      -5.8       1.3             5.5
26  2023-01-27      -7.3       NaN             NaN
27  2023-01-28      -5.6       0.0             NaN
28  2023-01-29      -1.8       0.0             NaN
29  2023-01-30      -1.3       NaN             NaN
30  2023-01-31       2.1       NaN             NaN

In [107]:
df1 = pd.read_csv('C:/Users/Admin/AI/downloads/카드소비데이터 수원시/SURFACE_ASOS_119_DAY_2023_2023_2024.csv', encoding='cp949')
df1.head(1).T

                              0
지점                          119
일시                   2023-01-01
평균기온(°C)                   -2.1
최저기온(°C)                   -6.6
최저기온 시각(hhmi)               728
최고기온(°C)                    3.5
최고기온 시각(hhmi)              1331
강수 계속시간(hr)                 NaN
10분 최다 강수량(mm)              NaN
10분 최다강수량 시각(hhmi)          NaN
1시간 최다강수량(mm)               NaN
1시간 최다 강수량 시각(hhmi)         NaN
일강수량(mm)                    NaN
최대 순간 풍속(m/s)               7.1
최대 순간 풍속 풍향(16방위)         270.0
최대 순간풍속 시각(hhmi)         1342.0
최대 풍속(m/s)                  4.2
최대 풍속 풍향(16방위)              290
최대 풍속 시각(hhmi)             1428
평균 풍속(m/s)                  1.8
풍정합(100m)                  1587
평균 이슬점온도(°C)               -9.0
최소 상대습도(%)                   35
최소 상대습도 시각(hhmi)           1256
평균 상대습도(%)                 63.1
평균 증기압(hPa)                 3.2
평균 현지기압(hPa)             1026.5
최고 해면기압(hPa)             1033.7
최고 해면기압 시각(hhmi)           2243
최저 해면기압(hPa)             1029.9
최저 해면기압 시각(hhmi)            426
평균 해면기압(hPa)             1031.6
가조시간(hr)                    9.7
합계 일조시간(hr)                 9.0
1시간 최다일사 시각(hhmi)          1200
1시간 최다일사량(MJ/m2)           1.83
합계 일사량(MJ/m2)             11.14
일 최심신적설(cm)                 NaN
일 최심신적설 시각(hhmi)            NaN
일 최심적설(cm)                  NaN
일 최심적설 시각(hhmi)             NaN
합계 3시간 신적설(cm)              NaN
평균 전운량(1/10)                1.5
평균 중하층운량(1/10)              1.3
평균 지면온도(°C)                -1.9
최저 초상온도(°C)               -11.3
평균 5cm 지중온도(°C)             NaN
평균 10cm 지중온도(°C)            NaN
평균 20cm 지중온도(°C)            NaN
평균 30cm 지중온도(°C)            NaN
0.5m 지중온도(°C)               NaN
1.0m 지중온도(°C)               NaN
1.5m 지중온도(°C)               NaN
3.0m 지중온도(°C)               NaN
5.0m 지중온도(°C)               NaN
합계 대형증발량(mm)                1.4
합계 소형증발량(mm)                2.0
9-9강수(mm)                   NaN
안개 계속시간(hr)                 NaN

## 행궁동 강수량

In [179]:
sw_rainfall_1 = pd.read_csv('C:/Users/Admin/AI/downloads/카드소비데이터 수원시/행궁동_강수_202301_202312.csv')
sw_rainfall_2 = pd.read_csv('C:/Users/Admin/AI/downloads/카드소비데이터 수원시/행궁동_강수_202401_202412.csv')
sw_rainfall_3 = pd.read_csv('C:/Users/Admin/AI/downloads/카드소비데이터 수원시/행궁동_강수_202501_202510.csv')

mask = sw_rainfall_1[' format: day'].astype(str).str.contains('Start')
sw_rainfall_1 = sw_rainfall_1[~mask].reset_index(drop=True)
days_2023 = pd.date_range('2023-01-01', '2023-12-31', freq='D')
full_dates = days_2023.repeat(24) 
# print(len(sw_rainfall_1), len(full_dates))
sw_rainfall_1['date'] = full_dates.strftime('%Y%m%d')
sw_rainfall_1.drop(columns=[' format: day'], inplace=True)
sw_rainfall_1.rename(columns={'value location:61_121 Start : 20230101 ': 'rainfall'},inplace=True)


mask = sw_rainfall_2[' format: day'].astype(str).str.contains('Start')
sw_rainfall_2 = sw_rainfall_2[~mask].reset_index(drop=True)
days_2024 = pd.date_range('2024-01-01', '2024-12-31', freq='D')
full_dates = days_2024.repeat(24) 
# print(len(sw_rainfall_2), len(full_dates))
sw_rainfall_2['date'] = full_dates.strftime('%Y%m%d')
sw_rainfall_2.drop(columns=[' format: day'], inplace=True)
sw_rainfall_2.rename(columns={'value location:61_121 Start : 20240101 ': 'rainfall'},inplace=True)


mask = sw_rainfall_3[' format: day'].astype(str).str.contains('Start')
sw_rainfall_3 = sw_rainfall_3[~mask].reset_index(drop=True)
days_2025 = pd.date_range('2025-01-01', '2025-10-31', freq='D')
full_dates = days_2025.repeat(24) 
# print(len(sw_rainfall_3), len(full_dates))
sw_rainfall_3['date'] = full_dates.strftime('%Y%m%d')
sw_rainfall_3.drop(columns=[' format: day'], inplace=True)
sw_rainfall_3.rename(columns={'value location:61_121 Start : 20250101 ': 'rainfall'},inplace=True)

# sw_rainfall_1.shape, sw_rainfall_2.shape, sw_rainfall_3.shape
sw_rainfall_3.iloc[744:746]

      hour  rainfall      date
744    0.0       0.0  20250201
745  100.0       0.0  20250201

In [197]:
sw_rainfall = pd.concat([sw_rainfall_1, sw_rainfall_2, sw_rainfall_3], ignore_index=True)
sw_rainfall = sw_rainfall[sw_rainfall['rainfall'] != 0].reset_index(drop=True)
sw_rainfall

        hour  rainfall      date
0     1000.0       0.1  20230106
1     1100.0       0.8  20230106
2     1200.0       0.1  20230106
3     1300.0       4.2  20230106
4     1400.0       0.3  20230106
...      ...       ...       ...
2043  1200.0       2.2  20251026
2044  1300.0       2.2  20251026
2045  1400.0       0.2  20251031
2046  1500.0       2.4  20251031
2047  1600.0       0.6  20251031

[2048 rows x 3 columns]

In [198]:
h = (sw_rainfall['hour'] // 100).astype(int)

def hour_to_slot(x):
    if   0  <= x <= 6: return 1    # 00:00~06:59
    elif 7  <= x <= 8: return 2    # 07:00~08:59
    elif 9  <= x <= 10:return 3    # 09:00~10:59
    elif 11 <= x <= 12:return 4    # 11:00~12:59
    elif 13 <= x <= 14:return 5    # 13:00~14:59
    elif 15 <= x <= 16:return 6    # 15:00~16:59
    elif 17 <= x <= 18:return 7    # 17:00~18:59
    elif 19 <= x <= 20:return 8    # 19:00~20:59
    elif 21 <= x <= 22:return 9    # 21:00~22:59
    elif x == 23:      return 10   # 23:00~23:59
    else:              return None   

sw_rainfall['time_slot'] = h.map(hour_to_slot)
sw_rainfall.columns = ['시간', '강수량', '기준년월일', '시간대']
sw_rainfall = sw_rainfall[['기준년월일', '시간대', '시간', '강수량']]
sw_rainfall

         기준년월일  시간대      시간  강수량
0     20230106    3  1000.0  0.1
1     20230106    4  1100.0  0.8
2     20230106    4  1200.0  0.1
3     20230106    5  1300.0  4.2
4     20230106    5  1400.0  0.3
...        ...  ...     ...  ...
2043  20251026    4  1200.0  2.2
2044  20251026    5  1300.0  2.2
2045  20251031    5  1400.0  0.2
2046  20251031    6  1500.0  2.4
2047  20251031    6  1600.0  0.6

[2048 rows x 4 columns]

In [203]:
sw_rainfall_group = (sw_rainfall.groupby(['기준년월일', '시간대'], as_index=False)['강수량'].mean())
sw_rainfall_group = sw_rainfall_group[sw_rainfall_group['강수량'] >= 0].reset_index(drop=True)
sw_rainfall_group

         기준년월일  시간대   강수량
0     20230106    3  0.10
1     20230106    4  0.45
2     20230106    5  2.25
3     20230106    8  0.10
4     20230112    5  0.10
...        ...  ...   ...
1113  20251026    1  0.10
1114  20251026    4  2.20
1115  20251026    5  2.20
1116  20251031    5  0.20
1117  20251031    6  1.50

[1118 rows x 3 columns]

## 행궁동 기온

In [218]:
sw_temp_1 = pd.read_csv('C:/Users/Admin/AI/downloads/카드소비데이터 수원시/행궁동_기온_202301_202312.csv')
sw_temp_2 = pd.read_csv('C:/Users/Admin/AI/downloads/카드소비데이터 수원시/행궁동_기온_202401_202412.csv')
sw_temp_3 = pd.read_csv('C:/Users/Admin/AI/downloads/카드소비데이터 수원시/행궁동_기온_202501_202510.csv')

mask = sw_temp_1[' format: day'].astype(str).str.contains('Start')
sw_temp_1 = sw_temp_1[~mask].reset_index(drop=True)
days_2023 = pd.date_range('2023-01-01', '2023-12-31', freq='D')
full_dates = days_2023.repeat(24) 
# print(len(sw_temp_1), len(full_dates))
sw_temp_1['date'] = full_dates.strftime('%Y%m%d')
sw_temp_1.drop(columns=[' format: day'], inplace=True)
sw_temp_1.rename(columns={'value location:61_121 Start : 20230101 ': 'temp'},inplace=True)

mask = sw_temp_2[' format: day'].astype(str).str.contains('Start')
sw_temp_2 = sw_temp_2[~mask].reset_index(drop=True)
days_2024 = pd.date_range('2024-01-01', '2024-12-31', freq='D')
full_dates = days_2024.repeat(24) 
# print(len(sw_rainfall_2), len(full_dates))
sw_temp_2['date'] = full_dates.strftime('%Y%m%d')
sw_temp_2.drop(columns=[' format: day'], inplace=True)
sw_temp_2.rename(columns={'value location:61_121 Start : 20240101 ': 'temp'},inplace=True)

mask = sw_temp_3[' format: day'].astype(str).str.contains('Start')
sw_temp_3 = sw_temp_3[~mask].reset_index(drop=True)
days_2025 = pd.date_range('2025-01-01', '2025-10-31', freq='D')
full_dates = days_2025.repeat(24) 
print(len(sw_rainfall_3), len(full_dates))
sw_temp_3['date'] = full_dates.strftime('%Y%m%d')
sw_temp_3.drop(columns=[' format: day'], inplace=True)
sw_temp_3.rename(columns={'value location:61_121 Start : 20250101 ': 'temp'},inplace=True)

sw_temp_3.iloc[743:746]

7296 7296

       hour  temp      date
743  2300.0   0.0  20250131
744     0.0   1.3  20250201
745   100.0   2.6  20250201

In [219]:
sw_temp = pd.concat([sw_temp_1, sw_temp_2, sw_temp_3], ignore_index=True)
sw_temp

         hour  temp      date
0         0.0   0.1  20230101
1       100.0   1.2  20230101
2       200.0   2.2  20230101
3       300.0   3.2  20230101
4       400.0   3.0  20230101
...       ...   ...       ...
24835  1900.0  11.1  20251031
24836  2000.0  10.3  20251031
24837  2100.0   9.4  20251031
24838  2200.0   9.3  20251031
24839  2300.0  12.0  20251031

[24840 rows x 3 columns]

In [220]:
h = (sw_temp['hour'] // 100).astype(int)

sw_temp['time_slot'] = h.map(hour_to_slot)
sw_temp.columns = ['시간', '기온', '기준년월일', '시간대']
sw_temp = sw_temp[['기준년월일', '시간대', '시간', '기온']]
sw_temp

          기준년월일  시간대      시간    기온
0      20230101    1     0.0   0.1
1      20230101    1   100.0   1.2
2      20230101    1   200.0   2.2
3      20230101    1   300.0   3.2
4      20230101    1   400.0   3.0
...         ...  ...     ...   ...
24835  20251031    8  1900.0  11.1
24836  20251031    8  2000.0  10.3
24837  20251031    9  2100.0   9.4
24838  20251031    9  2200.0   9.3
24839  20251031   10  2300.0  12.0

[24840 rows x 4 columns]

In [223]:
sw_temp_group = (sw_temp.groupby(['기준년월일', '시간대'], as_index=False)['기온'].mean())
sw_temp_group

          기준년월일  시간대     기온
0      20230101    1   2.10
1      20230101    2  -0.20
2      20230101    3  -2.25
3      20230101    4  -3.20
4      20230101    5  -4.10
...         ...  ...    ...
10345  20251031    6  11.65
10346  20251031    7  11.65
10347  20251031    8  10.70
10348  20251031    9   9.35
10349  20251031   10  12.00

[10350 rows x 3 columns]

In [3]:
sw_weather = pd.read_csv('C:/Users/Admin/AI/downloads/카드소비데이터 수원시/SURFACE_ASOS_119_HR_2023_2023_2024.csv', encoding='cp949')
sw_weather.drop(['지점','풍속(m/s)','풍향(16방위)','습도(%)','증기압(hPa)', '이슬점온도(°C)', '현지기압(hPa)', '해면기압(hPa)','전운량(10분위)', '중하층운량(10분위)',
       '운형(운형약어)', '최저운고(100m )', '시정(10m)', '지면상태(지면상태코드)', '현상번호(국내식)',
       '지면온도(°C)', '5cm 지중온도(°C)', '10cm 지중온도(°C)', '20cm 지중온도(°C)',
       '30cm 지중온도(°C)'], inplace=True, axis=1)
sw_weather

                    일시  기온(°C)  강수량(mm)  일조(hr)  일사(MJ/m2)  적설(cm)  3시간신적설(cm)
0     2023-01-01 00:00    -4.6      NaN     NaN        NaN     NaN         NaN
1     2023-01-01 01:00    -4.5      NaN     NaN        NaN     NaN         NaN
2     2023-01-01 02:00    -4.1      NaN     NaN        NaN     NaN         NaN
3     2023-01-01 03:00    -4.4      NaN     NaN        NaN     NaN         NaN
4     2023-01-01 04:00    -4.9      NaN     NaN        NaN     NaN         NaN
...                ...     ...      ...     ...        ...     ...         ...
8755  2023-12-31 19:00     2.1      NaN     NaN        NaN     NaN         NaN
8756  2023-12-31 20:00     1.1      NaN     NaN        NaN     NaN         NaN
8757  2023-12-31 21:00     0.0      NaN     NaN        NaN     NaN         NaN
8758  2023-12-31 22:00    -0.5      NaN     NaN        NaN     NaN         NaN
8759  2023-12-31 23:00    -0.8      NaN     NaN        NaN     NaN         NaN

[8760 rows x 7 columns]

In [26]:
sw_weather.columns

Index(['지점', '일시', '기온(°C)', '강수량(mm)', '풍속(m/s)', '풍향(16방위)', '습도(%)',
       '증기압(hPa)', '이슬점온도(°C)', '현지기압(hPa)', '해면기압(hPa)', '일조(hr)',
       '일사(MJ/m2)', '적설(cm)', '3시간신적설(cm)', '전운량(10분위)', '중하층운량(10분위)',
       '운형(운형약어)', '최저운고(100m )', '시정(10m)', '지면상태(지면상태코드)', '현상번호(국내식)',
       '지면온도(°C)', '5cm 지중온도(°C)', '10cm 지중온도(°C)', '20cm 지중온도(°C)',
       '30cm 지중온도(°C)'],
      dtype='object')

In [37]:
sw_weather[sw_weather['적설(cm)'].notna()]

                    일시  기온(°C)  강수량(mm)  일조(hr)  일사(MJ/m2)  적설(cm)  3시간신적설(cm)
344   2023-01-15 08:00    -0.7      NaN     0.0       0.00     0.1         NaN
345   2023-01-15 09:00    -1.1      0.8     0.0       0.00     0.5         0.5
346   2023-01-15 10:00    -1.2      NaN     0.0       0.00     0.6         NaN
347   2023-01-15 11:00    -1.4      NaN     0.0       0.18     0.8         NaN
348   2023-01-15 12:00    -1.4      0.1     0.0       0.14     0.8         0.3
...                ...     ...      ...     ...        ...     ...         ...
8733  2023-12-30 21:00     2.2      0.1     NaN        NaN     0.4         NaN
8734  2023-12-30 22:00     2.2      NaN     NaN        NaN     0.3         NaN
8735  2023-12-30 23:00     2.3      NaN     NaN        NaN     0.2         NaN
8736  2023-12-31 00:00     2.5      1.9     NaN        NaN     0.2         NaN
8737  2023-12-31 01:00     2.4      NaN     NaN        NaN     0.1         NaN

[353 rows x 7 columns]

## 행궁동 적설량

In [4]:
sw_snowfall_1 = sw_weather[['일시','적설(cm)']]
# sw_snowfall_1['시간'] = sw_snowfall_1['일시'].astype(str).str[11:13].astype(int)
# sw_snowfall_1['날짜'] = sw_snowfall_1['일시'].astype(str).str[:11]
sw_snowfall_1

                    일시  적설(cm)
0     2023-01-01 00:00     NaN
1     2023-01-01 01:00     NaN
2     2023-01-01 02:00     NaN
3     2023-01-01 03:00     NaN
4     2023-01-01 04:00     NaN
...                ...     ...
8755  2023-12-31 19:00     NaN
8756  2023-12-31 20:00     NaN
8757  2023-12-31 21:00     NaN
8758  2023-12-31 22:00     NaN
8759  2023-12-31 23:00     NaN

[8760 rows x 2 columns]

In [40]:
sw_snowfall_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8760 entries, 0 to 8759
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   일시      8760 non-null   object
 1   적설(cm)  353 non-null    float64
dtypes: float64(1), object(1)
memory usage: 137.0+ KB

In [5]:
hg_snowfall = pd.read_csv('c:/Users/Admin/AI/downloads/카드소비데이터 수원시/행궁동_1시간적설_20230101_20251031.csv')
hg_snowfall

,format: day,hour,forecast,value location:61_121 Start : 20230101
0,1,200.0,6.0,0.0
1,1,200.0,7.0,0.0
2,1,200.0,8.0,0.0
3,1,200.0,9.0,0.0
4,1,200.0,10.0,0.0
...,...,...,...,...
547933,31,2300.0,76.0,0.0
547934,31,2300.0,79.0,0.0
547935,31,2300.0,82.0,0.0
547936,31,2300.0,85.0,0.0
547937,31,2300.0,88.0,0.0

In [10]:
hg_snowfall[hg_snowfall['value  location:61_121 Start : 20230101 ']>0]

,format: day,hour,forecast,value location:61_121 Start : 20230101
162761,16,2000.0,9.0,1.4
162820,16,2300.0,6.0,1.4
176769,14,800.0,43.0,1.0
176770,14,800.0,44.0,1.0
178688,18,200.0,35.0,1.1
...,...,...,...,...
416791,17,500.0,11.0,1.2
416850,17,800.0,9.0,1.0
416851,17,800.0,10.0,1.8
416929,17,1100.0,6.0,1.0
416930,17,1100.0,7.0,1.8

## 행궁동 구름

In [28]:
hg_cloud = pd.read_csv('c:/Users/Admin/AI/downloads/카드소비데이터 수원시/행궁동_하늘상태_20230101_20251031.csv')
hg_cloud.drop('forecast', inplace=True, axis=1)
hg_cloud

        format: day    hour  value  location:61_121 Start : 20230101
0                 1   200.0                                       1.0
1                 1   200.0                                       1.0
2                 1   200.0                                       3.0
3                 1   200.0                                       3.0
4                 1   200.0                                       3.0
...             ...     ...                                       ...
548441           31  2300.0                                       1.0
548442           31  2300.0                                       1.0
548443           31  2300.0                                       1.0
548444           31  2300.0                                       1.0
548445           31  2300.0                                       1.0

[548446 rows x 3 columns]

In [74]:
hg_cloud['H'] = (hg_cloud['hour'] // 100).astype(int)
hg_cloud.drop('hour', axis=1, inplace=True)
hg_cloud

In [24]:
# hg_cloud.groupby([' format: day', 'hour'], as_index=False)['value  location:61_121 Start : 20230101 '].max()
hg_cloud.iloc[::50] # 2,5,8,11,14,17,20,23

        format: day    hour  value  location:61_121 Start : 20230101
0                 1   200.0                                       1.0
50                1   200.0                                       1.0
100               1   500.0                                       1.0
150               1   800.0                                       1.0
200               1  1100.0                                       1.0
...             ...     ...                                       ...
547200           31  1400.0                                       1.0
547250           31  1700.0                                       1.0
547300           31  2000.0                                       3.0
547350           31  2300.0                                       1.0
547400           31  2300.0                                       1.0

[10949 rows x 3 columns]

In [15]:
mask = hg_cloud[' format: day'].astype(str).str.contains('Start')
hg_cloud = hg_cloud[~mask].reset_index(drop=True)
days = pd.date_range('2023-01-01', '2025-10-31', freq='D')
full_dates = days.repeat(24) 
print(len(hg_cloud), len(full_dates))
# hg_cloud['date'] = full_dates.strftime('%Y%m%d')
# hg_cloud.drop(columns=[' format: day'], inplace=True)
# hg_cloud.rename(columns={'value  location:61_121 Start : 20230101 ': 'cloud'},inplace=True)

547412 24840

In [13]:
hg_cloud.columns

Index([' format: day', 'hour', 'value  location:61_121 Start : 20230101 '], dtype='object')

## 시간대

In [8]:
def hour_to_slot(x):
    if   0  <= x <= 6: return 1    # 00:00~06:59
    elif 7  <= x <= 8: return 2    # 07:00~08:59
    elif 9  <= x <= 10:return 3    # 09:00~10:59
    elif 11 <= x <= 12:return 4    # 11:00~12:59
    elif 13 <= x <= 14:return 5    # 13:00~14:59
    elif 15 <= x <= 16:return 6    # 15:00~16:59
    elif 17 <= x <= 18:return 7    # 17:00~18:59
    elif 19 <= x <= 20:return 8    # 19:00~20:59
    elif 21 <= x <= 22:return 9    # 21:00~22:59
    elif x == 23:      return 10   # 23:00~23:59
    else:              return None

## 기온

### 장안구 송죽동 기온

In [11]:
# 파일셋
sw_temp_1 = pd.read_csv('data/수원시 기상/송죽동_기온_202301_202312.csv')
sw_temp_2 = pd.read_csv('data/수원시 기상/송죽동_기온_202401_202412.csv')
sw_temp_3 = pd.read_csv('data/수원시 기상/송죽동_기온_202501_202510.csv')

# 날짜변환
mask = sw_temp_1[' format: day'].astype(str).str.contains('Start')
sw_temp_1 = sw_temp_1[~mask].reset_index(drop=True)
days_2023 = pd.date_range('2023-01-01', '2023-12-31', freq='D')
full_dates = days_2023.repeat(24) 
print(len(sw_temp_1), len(full_dates))
sw_temp_1['date'] = full_dates.strftime('%Y%m%d')
sw_temp_1.drop(columns=[' format: day'], inplace=True)
sw_temp_1.rename(columns={'value location:60_121 Start : 20230101 ': 'temp'},inplace=True)

mask = sw_temp_2[' format: day'].astype(str).str.contains('Start')
sw_temp_2 = sw_temp_2[~mask].reset_index(drop=True)
days_2024 = pd.date_range('2024-01-01', '2024-12-31', freq='D')
full_dates = days_2024.repeat(24) 
print(len(sw_temp_2), len(full_dates))
sw_temp_2['date'] = full_dates.strftime('%Y%m%d')
sw_temp_2.drop(columns=[' format: day'], inplace=True)
sw_temp_2.rename(columns={'value location:60_121 Start : 20240101 ': 'temp'},inplace=True)

mask = sw_temp_3[' format: day'].astype(str).str.contains('Start')
sw_temp_3 = sw_temp_3[~mask].reset_index(drop=True)
days_2025 = pd.date_range('2025-01-01', '2025-10-31', freq='D')
full_dates = days_2025.repeat(24) 
print(len(sw_temp_3), len(full_dates))
sw_temp_3['date'] = full_dates.strftime('%Y%m%d')
sw_temp_3.drop(columns=[' format: day'], inplace=True)
sw_temp_3.rename(columns={'value location:60_121 Start : 20250101 ': 'temp'},inplace=True)

# 컨캣
sw_jangan_temp = pd.concat([sw_temp_1, sw_temp_2, sw_temp_3], ignore_index=True)

# 시간합
h = (sw_jangan_temp['hour'] // 100).astype(int)

sw_jangan_temp['time_slot'] = h.map(hour_to_slot)
sw_jangan_temp.columns = ['시간', '기온', '기준년월일', '시간대']
sw_jangan_temp = sw_jangan_temp[['기준년월일', '시간대', '시간', '기온']]
sw_jangan_temp = (sw_jangan_temp.groupby(['기준년월일', '시간대'], as_index=False)['기온'].mean())
sw_jangan_temp

8760 8760
8784 8784
7296 7296

          기준년월일  시간대     기온
0      20230101    1   2.10
1      20230101    2  -0.20
2      20230101    3  -2.25
3      20230101    4  -3.20
4      20230101    5  -4.10
...         ...  ...    ...
10345  20251031    6  11.65
10346  20251031    7  11.65
10347  20251031    8  10.70
10348  20251031    9   9.35
10349  20251031   10  12.00

[10350 rows x 3 columns]

### 권선구 평동 기온

In [12]:
# 파일셋
sw_temp_1 = pd.read_csv('data/수원시 기상/평동_기온_202301_202312.csv')
sw_temp_2 = pd.read_csv('data/수원시 기상/평동_기온_202401_202412.csv')
sw_temp_3 = pd.read_csv('data/수원시 기상/평동_기온_202501_202510.csv')

# 날짜변환
mask = sw_temp_1[' format: day'].astype(str).str.contains('Start')
sw_temp_1 = sw_temp_1[~mask].reset_index(drop=True)
days_2023 = pd.date_range('2023-01-01', '2023-12-31', freq='D')
full_dates = days_2023.repeat(24) 
print(len(sw_temp_1), len(full_dates))
sw_temp_1['date'] = full_dates.strftime('%Y%m%d')
sw_temp_1.drop(columns=[' format: day'], inplace=True)
sw_temp_1.rename(columns={'value location:60_120 Start : 20230101 ': 'temp'},inplace=True)

mask = sw_temp_2[' format: day'].astype(str).str.contains('Start')
sw_temp_2 = sw_temp_2[~mask].reset_index(drop=True)
days_2024 = pd.date_range('2024-01-01', '2024-12-31', freq='D')
full_dates = days_2024.repeat(24) 
print(len(sw_temp_2), len(full_dates))
sw_temp_2['date'] = full_dates.strftime('%Y%m%d')
sw_temp_2.drop(columns=[' format: day'], inplace=True)
sw_temp_2.rename(columns={'value location:60_120 Start : 20240101 ': 'temp'},inplace=True)

mask = sw_temp_3[' format: day'].astype(str).str.contains('Start')
sw_temp_3 = sw_temp_3[~mask].reset_index(drop=True)
days_2025 = pd.date_range('2025-01-01', '2025-10-31', freq='D')
full_dates = days_2025.repeat(24) 
print(len(sw_temp_3), len(full_dates))
sw_temp_3['date'] = full_dates.strftime('%Y%m%d')
sw_temp_3.drop(columns=[' format: day'], inplace=True)
sw_temp_3.rename(columns={'value location:60_120 Start : 20250101 ': 'temp'},inplace=True)

# 컨캣
sw_gwonsun_temp = pd.concat([sw_temp_1, sw_temp_2, sw_temp_3], ignore_index=True)

# 시간합
h = (sw_gwonsun_temp['hour'] // 100).astype(int)

sw_gwonsun_temp['time_slot'] = h.map(hour_to_slot)
sw_gwonsun_temp.columns = ['시간', '기온', '기준년월일', '시간대']
sw_gwonsun_temp = sw_gwonsun_temp[['기준년월일', '시간대', '시간', '기온']]
sw_gwonsun_temp = (sw_gwonsun_temp.groupby(['기준년월일', '시간대'], as_index=False)['기온'].mean())
sw_gwonsun_temp

8760 8760
8784 8784
7296 7296

          기준년월일  시간대     기온
0      20230101    1   2.10
1      20230101    2  -0.20
2      20230101    3  -2.25
3      20230101    4  -3.20
4      20230101    5  -4.10
...         ...  ...    ...
10345  20251031    6  11.65
10346  20251031    7  11.65
10347  20251031    8  10.70
10348  20251031    9   9.35
10349  20251031   10  12.00

[10350 rows x 3 columns]

### 팔달구 행궁동 기온

In [13]:
# 파일셋
sw_temp_1 = pd.read_csv('data/수원시 기상/행궁동_기온_202301_202312.csv')
sw_temp_2 = pd.read_csv('data/수원시 기상/행궁동_기온_202401_202412.csv')
sw_temp_3 = pd.read_csv('data/수원시 기상/행궁동_기온_202501_202510.csv')

# 날짜변환
mask = sw_temp_1[' format: day'].astype(str).str.contains('Start')
sw_temp_1 = sw_temp_1[~mask].reset_index(drop=True)
days_2023 = pd.date_range('2023-01-01', '2023-12-31', freq='D')
full_dates = days_2023.repeat(24) 
print(len(sw_temp_1), len(full_dates))
sw_temp_1['date'] = full_dates.strftime('%Y%m%d')
sw_temp_1.drop(columns=[' format: day'], inplace=True)
sw_temp_1.rename(columns={'value location:61_121 Start : 20230101 ': 'temp'},inplace=True)

mask = sw_temp_2[' format: day'].astype(str).str.contains('Start')
sw_temp_2 = sw_temp_2[~mask].reset_index(drop=True)
days_2024 = pd.date_range('2024-01-01', '2024-12-31', freq='D')
full_dates = days_2024.repeat(24) 
print(len(sw_temp_2), len(full_dates))
sw_temp_2['date'] = full_dates.strftime('%Y%m%d')
sw_temp_2.drop(columns=[' format: day'], inplace=True)
sw_temp_2.rename(columns={'value location:61_121 Start : 20240101 ': 'temp'},inplace=True)

mask = sw_temp_3[' format: day'].astype(str).str.contains('Start')
sw_temp_3 = sw_temp_3[~mask].reset_index(drop=True)
days_2025 = pd.date_range('2025-01-01', '2025-10-31', freq='D')
full_dates = days_2025.repeat(24) 
print(len(sw_temp_3), len(full_dates))
sw_temp_3['date'] = full_dates.strftime('%Y%m%d')
sw_temp_3.drop(columns=[' format: day'], inplace=True)
sw_temp_3.rename(columns={'value location:61_121 Start : 20250101 ': 'temp'},inplace=True)

# 컨캣
sw_paldal_temp = pd.concat([sw_temp_1, sw_temp_2, sw_temp_3], ignore_index=True)

# 시간합
h = (sw_paldal_temp['hour'] // 100).astype(int)

sw_paldal_temp['time_slot'] = h.map(hour_to_slot)
sw_paldal_temp.columns = ['시간', '기온', '기준년월일', '시간대']
sw_paldal_temp = sw_paldal_temp[['기준년월일', '시간대', '시간', '기온']]
sw_paldal_temp = (sw_paldal_temp.groupby(['기준년월일', '시간대'], as_index=False)['기온'].mean())
sw_paldal_temp

8760 8760
8784 8784
7296 7296

          기준년월일  시간대     기온
0      20230101    1   2.10
1      20230101    2  -0.20
2      20230101    3  -2.25
3      20230101    4  -3.20
4      20230101    5  -4.10
...         ...  ...    ...
10345  20251031    6  11.65
10346  20251031    7  11.65
10347  20251031    8  10.70
10348  20251031    9   9.35
10349  20251031   10  12.00

[10350 rows x 3 columns]

### 영통구 원천동 기온

In [14]:
# 파일셋
sw_temp_1 = pd.read_csv('data/수원시 기상/원천동_기온_202301_202312.csv')
sw_temp_2 = pd.read_csv('data/수원시 기상/원천동_기온_202401_202412.csv')
sw_temp_3 = pd.read_csv('data/수원시 기상/원천동_기온_202501_202510.csv')

# 날짜변환
mask = sw_temp_1[' format: day'].astype(str).str.contains('Start')
sw_temp_1 = sw_temp_1[~mask].reset_index(drop=True)
days_2023 = pd.date_range('2023-01-01', '2023-12-31', freq='D')
full_dates = days_2023.repeat(24) 
print(len(sw_temp_1), len(full_dates))
sw_temp_1['date'] = full_dates.strftime('%Y%m%d')
sw_temp_1.drop(columns=[' format: day'], inplace=True)
sw_temp_1.rename(columns={'value location:61_120 Start : 20230101 ': 'temp'},inplace=True)

mask = sw_temp_2[' format: day'].astype(str).str.contains('Start')
sw_temp_2 = sw_temp_2[~mask].reset_index(drop=True)
days_2024 = pd.date_range('2024-01-01', '2024-12-31', freq='D')
full_dates = days_2024.repeat(24) 
print(len(sw_temp_2), len(full_dates))
sw_temp_2['date'] = full_dates.strftime('%Y%m%d')
sw_temp_2.drop(columns=[' format: day'], inplace=True)
sw_temp_2.rename(columns={'value location:61_120 Start : 20240101 ': 'temp'},inplace=True)

mask = sw_temp_3[' format: day'].astype(str).str.contains('Start')
sw_temp_3 = sw_temp_3[~mask].reset_index(drop=True)
days_2025 = pd.date_range('2025-01-01', '2025-10-31', freq='D')
full_dates = days_2025.repeat(24) 
print(len(sw_temp_3), len(full_dates))
sw_temp_3['date'] = full_dates.strftime('%Y%m%d')
sw_temp_3.drop(columns=[' format: day'], inplace=True)
sw_temp_3.rename(columns={'value location:61_120 Start : 20250101 ': 'temp'},inplace=True)

# 컨캣
sw_yeongtong_temp = pd.concat([sw_temp_1, sw_temp_2, sw_temp_3], ignore_index=True)

# 시간합
h = (sw_yeongtong_temp['hour'] // 100).astype(int)

sw_yeongtong_temp['time_slot'] = h.map(hour_to_slot)
sw_yeongtong_temp.columns = ['시간', '기온', '기준년월일', '시간대']
sw_yeongtong_temp = sw_yeongtong_temp[['기준년월일', '시간대', '시간', '기온']]
sw_yeongtong_temp = (sw_yeongtong_temp.groupby(['기준년월일', '시간대'], as_index=False)['기온'].mean())
sw_yeongtong_temp

8760 8760
8784 8784
7296 7296

          기준년월일  시간대     기온
0      20230101    1   2.10
1      20230101    2  -0.20
2      20230101    3  -2.25
3      20230101    4  -3.20
4      20230101    5  -4.10
...         ...  ...    ...
10345  20251031    6  11.65
10346  20251031    7  11.65
10347  20251031    8  10.70
10348  20251031    9   9.35
10349  20251031   10  12.00

[10350 rows x 3 columns]

## 강수량

### 장안구 송죽동 강수량

In [15]:
# 파일셋
sw_temp_1 = pd.read_csv('data/수원시 기상/송죽동_강수_202301_202312.csv')
sw_temp_2 = pd.read_csv('data/수원시 기상/송죽동_강수_202401_202412.csv')
sw_temp_3 = pd.read_csv('data/수원시 기상/송죽동_강수_202501_202510.csv')

# 날짜변환
mask = sw_temp_1[' format: day'].astype(str).str.contains('Start')
sw_temp_1 = sw_temp_1[~mask].reset_index(drop=True)
days_2023 = pd.date_range('2023-01-01', '2023-12-31', freq='D')
full_dates = days_2023.repeat(24) 
print(len(sw_temp_1), len(full_dates))
sw_temp_1['date'] = full_dates.strftime('%Y%m%d')
sw_temp_1.drop(columns=[' format: day'], inplace=True)
sw_temp_1.rename(columns={'value location:60_121 Start : 20230101 ': 'temp'},inplace=True)

mask = sw_temp_2[' format: day'].astype(str).str.contains('Start')
sw_temp_2 = sw_temp_2[~mask].reset_index(drop=True)
days_2024 = pd.date_range('2024-01-01', '2024-12-31', freq='D')
full_dates = days_2024.repeat(24) 
print(len(sw_temp_2), len(full_dates))
sw_temp_2['date'] = full_dates.strftime('%Y%m%d')
sw_temp_2.drop(columns=[' format: day'], inplace=True)
sw_temp_2.rename(columns={'value location:60_121 Start : 20240101 ': 'temp'},inplace=True)

mask = sw_temp_3[' format: day'].astype(str).str.contains('Start')
sw_temp_3 = sw_temp_3[~mask].reset_index(drop=True)
days_2025 = pd.date_range('2025-01-01', '2025-10-31', freq='D')
full_dates = days_2025.repeat(24) 
print(len(sw_temp_3), len(full_dates))
sw_temp_3['date'] = full_dates.strftime('%Y%m%d')
sw_temp_3.drop(columns=[' format: day'], inplace=True)
sw_temp_3.rename(columns={'value location:60_121 Start : 20250101 ': 'temp'},inplace=True)

# 컨캣
sw_jangan_rain = pd.concat([sw_temp_1, sw_temp_2, sw_temp_3], ignore_index=True)

# 시간합
h = (sw_jangan_rain['hour'] // 100).astype(int)

sw_jangan_rain['time_slot'] = h.map(hour_to_slot)
sw_jangan_rain.columns = ['시간', '강수', '기준년월일', '시간대']
sw_jangan_rain = sw_jangan_rain[['기준년월일', '시간대', '시간', '강수']]
sw_jangan_rain = (sw_jangan_rain.groupby(['기준년월일', '시간대'], as_index=False)['강수'].mean())
sw_jangan_rain

8760 8760
8784 8784
7296 7296

          기준년월일  시간대   강수
0      20230101    1  0.0
1      20230101    2  0.0
2      20230101    3  0.0
3      20230101    4  0.0
4      20230101    5  0.0
...         ...  ...  ...
10345  20251031    6  1.5
10346  20251031    7  0.0
10347  20251031    8  0.0
10348  20251031    9  0.0
10349  20251031   10  0.0

[10350 rows x 3 columns]

### 권선구 평동 강수량

In [16]:
# 파일셋
sw_temp_1 = pd.read_csv('data/수원시 기상/평동_강수_202301_202312.csv')
sw_temp_2 = pd.read_csv('data/수원시 기상/평동_강수_202401_202412.csv')
sw_temp_3 = pd.read_csv('data/수원시 기상/평동_강수_202501_202510.csv')

# 날짜변환
mask = sw_temp_1[' format: day'].astype(str).str.contains('Start')
sw_temp_1 = sw_temp_1[~mask].reset_index(drop=True)
days_2023 = pd.date_range('2023-01-01', '2023-12-31', freq='D')
full_dates = days_2023.repeat(24) 
print(len(sw_temp_1), len(full_dates))
sw_temp_1['date'] = full_dates.strftime('%Y%m%d')
sw_temp_1.drop(columns=[' format: day'], inplace=True)
sw_temp_1.rename(columns={'value location:60_120 Start : 20230101 ': 'temp'},inplace=True)

mask = sw_temp_2[' format: day'].astype(str).str.contains('Start')
sw_temp_2 = sw_temp_2[~mask].reset_index(drop=True)
days_2024 = pd.date_range('2024-01-01', '2024-12-31', freq='D')
full_dates = days_2024.repeat(24) 
print(len(sw_temp_2), len(full_dates))
sw_temp_2['date'] = full_dates.strftime('%Y%m%d')
sw_temp_2.drop(columns=[' format: day'], inplace=True)
sw_temp_2.rename(columns={'value location:60_120 Start : 20240101 ': 'temp'},inplace=True)

mask = sw_temp_3[' format: day'].astype(str).str.contains('Start')
sw_temp_3 = sw_temp_3[~mask].reset_index(drop=True)
days_2025 = pd.date_range('2025-01-01', '2025-10-31', freq='D')
full_dates = days_2025.repeat(24) 
print(len(sw_temp_3), len(full_dates))
sw_temp_3['date'] = full_dates.strftime('%Y%m%d')
sw_temp_3.drop(columns=[' format: day'], inplace=True)
sw_temp_3.rename(columns={'value location:60_120 Start : 20250101 ': 'temp'},inplace=True)

# 컨캣
sw_gwonsun_rain = pd.concat([sw_temp_1, sw_temp_2, sw_temp_3], ignore_index=True)

# 시간합
h = (sw_gwonsun_rain['hour'] // 100).astype(int)

sw_gwonsun_rain['time_slot'] = h.map(hour_to_slot)
sw_gwonsun_rain.columns = ['시간', '강수', '기준년월일', '시간대']
sw_gwonsun_rain = sw_gwonsun_rain[['기준년월일', '시간대', '시간', '강수']]
sw_gwonsun_rain = (sw_gwonsun_rain.groupby(['기준년월일', '시간대'], as_index=False)['강수'].mean())
sw_gwonsun_rain

8760 8760
8784 8784
7296 7296

          기준년월일  시간대   강수
0      20230101    1  0.0
1      20230101    2  0.0
2      20230101    3  0.0
3      20230101    4  0.0
4      20230101    5  0.0
...         ...  ...  ...
10345  20251031    6  1.5
10346  20251031    7  0.0
10347  20251031    8  0.0
10348  20251031    9  0.0
10349  20251031   10  0.0

[10350 rows x 3 columns]

### 팔달구 행궁동 강수량

In [17]:
# 파일셋
sw_temp_1 = pd.read_csv('data/수원시 기상/행궁동_강수_202301_202312.csv')
sw_temp_2 = pd.read_csv('data/수원시 기상/행궁동_강수_202401_202412.csv')
sw_temp_3 = pd.read_csv('data/수원시 기상/행궁동_강수_202501_202510.csv')

# 날짜변환
mask = sw_temp_1[' format: day'].astype(str).str.contains('Start')
sw_temp_1 = sw_temp_1[~mask].reset_index(drop=True)
days_2023 = pd.date_range('2023-01-01', '2023-12-31', freq='D')
full_dates = days_2023.repeat(24) 
print(len(sw_temp_1), len(full_dates))
sw_temp_1['date'] = full_dates.strftime('%Y%m%d')
sw_temp_1.drop(columns=[' format: day'], inplace=True)
sw_temp_1.rename(columns={'value location:61_121 Start : 20230101 ': 'temp'},inplace=True)

mask = sw_temp_2[' format: day'].astype(str).str.contains('Start')
sw_temp_2 = sw_temp_2[~mask].reset_index(drop=True)
days_2024 = pd.date_range('2024-01-01', '2024-12-31', freq='D')
full_dates = days_2024.repeat(24) 
print(len(sw_temp_2), len(full_dates))
sw_temp_2['date'] = full_dates.strftime('%Y%m%d')
sw_temp_2.drop(columns=[' format: day'], inplace=True)
sw_temp_2.rename(columns={'value location:61_121 Start : 20240101 ': 'temp'},inplace=True)

mask = sw_temp_3[' format: day'].astype(str).str.contains('Start')
sw_temp_3 = sw_temp_3[~mask].reset_index(drop=True)
days_2025 = pd.date_range('2025-01-01', '2025-10-31', freq='D')
full_dates = days_2025.repeat(24) 
print(len(sw_temp_3), len(full_dates))
sw_temp_3['date'] = full_dates.strftime('%Y%m%d')
sw_temp_3.drop(columns=[' format: day'], inplace=True)
sw_temp_3.rename(columns={'value location:61_121 Start : 20250101 ': 'temp'},inplace=True)

# 컨캣
sw_paldal_rain = pd.concat([sw_temp_1, sw_temp_2, sw_temp_3], ignore_index=True)

# 시간합
h = (sw_paldal_rain['hour'] // 100).astype(int)

sw_paldal_rain['time_slot'] = h.map(hour_to_slot)
sw_paldal_rain.columns = ['시간', '강수', '기준년월일', '시간대']
sw_paldal_rain = sw_paldal_rain[['기준년월일', '시간대', '시간', '강수']]
sw_paldal_rain = (sw_paldal_rain.groupby(['기준년월일', '시간대'], as_index=False)['강수'].mean())
sw_paldal_rain

8760 8760
8784 8784
7296 7296

          기준년월일  시간대   강수
0      20230101    1  0.0
1      20230101    2  0.0
2      20230101    3  0.0
3      20230101    4  0.0
4      20230101    5  0.0
...         ...  ...  ...
10345  20251031    6  1.5
10346  20251031    7  0.0
10347  20251031    8  0.0
10348  20251031    9  0.0
10349  20251031   10  0.0

[10350 rows x 3 columns]

### 영통구 원천동 강수량

In [18]:
# 파일셋
sw_temp_1 = pd.read_csv('data/수원시 기상/원천동_강수_202301_202312.csv')
sw_temp_2 = pd.read_csv('data/수원시 기상/원천동_강수_202401_202412.csv')
sw_temp_3 = pd.read_csv('data/수원시 기상/원천동_강수_202501_202510.csv')

# 날짜변환
mask = sw_temp_1[' format: day'].astype(str).str.contains('Start')
sw_temp_1 = sw_temp_1[~mask].reset_index(drop=True)
days_2023 = pd.date_range('2023-01-01', '2023-12-31', freq='D')
full_dates = days_2023.repeat(24) 
print(len(sw_temp_1), len(full_dates))
sw_temp_1['date'] = full_dates.strftime('%Y%m%d')
sw_temp_1.drop(columns=[' format: day'], inplace=True)
sw_temp_1.rename(columns={'value location:61_120 Start : 20230101 ': 'temp'},inplace=True)

mask = sw_temp_2[' format: day'].astype(str).str.contains('Start')
sw_temp_2 = sw_temp_2[~mask].reset_index(drop=True)
days_2024 = pd.date_range('2024-01-01', '2024-12-31', freq='D')
full_dates = days_2024.repeat(24) 
print(len(sw_temp_2), len(full_dates))
sw_temp_2['date'] = full_dates.strftime('%Y%m%d')
sw_temp_2.drop(columns=[' format: day'], inplace=True)
sw_temp_2.rename(columns={'value location:61_120 Start : 20240101 ': 'temp'},inplace=True)

mask = sw_temp_3[' format: day'].astype(str).str.contains('Start')
sw_temp_3 = sw_temp_3[~mask].reset_index(drop=True)
days_2025 = pd.date_range('2025-01-01', '2025-10-31', freq='D')
full_dates = days_2025.repeat(24) 
print(len(sw_temp_3), len(full_dates))
sw_temp_3['date'] = full_dates.strftime('%Y%m%d')
sw_temp_3.drop(columns=[' format: day'], inplace=True)
sw_temp_3.rename(columns={'value location:61_120 Start : 20250101 ': 'temp'},inplace=True)

# 컨캣
sw_yeongtong_rain = pd.concat([sw_temp_1, sw_temp_2, sw_temp_3], ignore_index=True)

# 시간합
h = (sw_yeongtong_rain['hour'] // 100).astype(int)

sw_yeongtong_rain['time_slot'] = h.map(hour_to_slot)
sw_yeongtong_rain.columns = ['시간', '강수', '기준년월일', '시간대']
sw_yeongtong_rain = sw_yeongtong_rain[['기준년월일', '시간대', '시간', '강수']]
sw_yeongtong_rain = (sw_yeongtong_rain.groupby(['기준년월일', '시간대'], as_index=False)['강수'].mean())
sw_yeongtong_rain

8760 8760
8784 8784
7296 7296

          기준년월일  시간대   강수
0      20230101    1  0.0
1      20230101    2  0.0
2      20230101    3  0.0
3      20230101    4  0.0
4      20230101    5  0.0
...         ...  ...  ...
10345  20251031    6  1.5
10346  20251031    7  0.0
10347  20251031    8  0.0
10348  20251031    9  0.0
10349  20251031   10  0.0

[10350 rows x 3 columns]

## 강수형태

### 장안구 송죽동 강수형태

In [19]:
# 파일셋
sw_temp_1 = pd.read_csv('data/수원시 기상/송죽동_강수형태_202301_202312.csv')
sw_temp_2 = pd.read_csv('data/수원시 기상/송죽동_강수형태_202401_202412.csv')
sw_temp_3 = pd.read_csv('data/수원시 기상/송죽동_강수형태_202501_202510.csv')

# 날짜변환
mask = sw_temp_1[' format: day'].astype(str).str.contains('Start')
sw_temp_1 = sw_temp_1[~mask].reset_index(drop=True)
days_2023 = pd.date_range('2023-01-01', '2023-12-31', freq='D')
full_dates = days_2023.repeat(24) 
print(len(sw_temp_1), len(full_dates))
sw_temp_1['date'] = full_dates.strftime('%Y%m%d')
sw_temp_1.drop(columns=[' format: day'], inplace=True)
sw_temp_1.rename(columns={'value location:60_121 Start : 20230101 ': 'temp'},inplace=True)

mask = sw_temp_2[' format: day'].astype(str).str.contains('Start')
sw_temp_2 = sw_temp_2[~mask].reset_index(drop=True)
days_2024 = pd.date_range('2024-01-01', '2024-12-31', freq='D')
full_dates = days_2024.repeat(24) 
print(len(sw_temp_2), len(full_dates))
sw_temp_2['date'] = full_dates.strftime('%Y%m%d')
sw_temp_2.drop(columns=[' format: day'], inplace=True)
sw_temp_2.rename(columns={'value location:60_121 Start : 20240101 ': 'temp'},inplace=True)

mask = sw_temp_3[' format: day'].astype(str).str.contains('Start')
sw_temp_3 = sw_temp_3[~mask].reset_index(drop=True)
days_2025 = pd.date_range('2025-01-01', '2025-10-31', freq='D')
full_dates = days_2025.repeat(24) 
print(len(sw_temp_3), len(full_dates))
sw_temp_3['date'] = full_dates.strftime('%Y%m%d')
sw_temp_3.drop(columns=[' format: day'], inplace=True)
sw_temp_3.rename(columns={'value location:60_121 Start : 20250101 ': 'temp'},inplace=True)

# 컨캣
sw_jangan_pty = pd.concat([sw_temp_1, sw_temp_2, sw_temp_3], ignore_index=True)

# 시간합
h = (sw_jangan_pty['hour'] // 100).astype(int)

sw_jangan_pty['time_slot'] = h.map(hour_to_slot)
sw_jangan_pty.columns = ['시간', '강수형태', '기준년월일', '시간대']
sw_jangan_pty = sw_jangan_pty[['기준년월일', '시간대', '시간', '강수형태']]
sw_jangan_pty = (sw_jangan_pty.groupby(['기준년월일', '시간대'], as_index=False)['강수형태'].max())
sw_jangan_pty

8760 8760
8784 8784
7296 7296

          기준년월일  시간대  강수형태
0      20230101    1   0.0
1      20230101    2   0.0
2      20230101    3   0.0
3      20230101    4   0.0
4      20230101    5   0.0
...         ...  ...   ...
10345  20251031    6   1.0
10346  20251031    7   0.0
10347  20251031    8   0.0
10348  20251031    9   0.0
10349  20251031   10   0.0

[10350 rows x 3 columns]

### 권선구 평동 강수형태

In [20]:
# 파일셋
sw_temp_1 = pd.read_csv('data/수원시 기상/평동_강수형태_202301_202312.csv')
sw_temp_2 = pd.read_csv('data/수원시 기상/평동_강수형태_202401_202412.csv')
sw_temp_3 = pd.read_csv('data/수원시 기상/평동_강수형태_202501_202510.csv')

# 날짜변환
mask = sw_temp_1[' format: day'].astype(str).str.contains('Start')
sw_temp_1 = sw_temp_1[~mask].reset_index(drop=True)
days_2023 = pd.date_range('2023-01-01', '2023-12-31', freq='D')
full_dates = days_2023.repeat(24) 
print(len(sw_temp_1), len(full_dates))
sw_temp_1['date'] = full_dates.strftime('%Y%m%d')
sw_temp_1.drop(columns=[' format: day'], inplace=True)
sw_temp_1.rename(columns={'value location:60_120 Start : 20230101 ': 'temp'},inplace=True)

mask = sw_temp_2[' format: day'].astype(str).str.contains('Start')
sw_temp_2 = sw_temp_2[~mask].reset_index(drop=True)
days_2024 = pd.date_range('2024-01-01', '2024-12-31', freq='D')
full_dates = days_2024.repeat(24) 
print(len(sw_temp_2), len(full_dates))
sw_temp_2['date'] = full_dates.strftime('%Y%m%d')
sw_temp_2.drop(columns=[' format: day'], inplace=True)
sw_temp_2.rename(columns={'value location:60_120 Start : 20240101 ': 'temp'},inplace=True)

mask = sw_temp_3[' format: day'].astype(str).str.contains('Start')
sw_temp_3 = sw_temp_3[~mask].reset_index(drop=True)
days_2025 = pd.date_range('2025-01-01', '2025-10-31', freq='D')
full_dates = days_2025.repeat(24) 
print(len(sw_temp_3), len(full_dates))
sw_temp_3['date'] = full_dates.strftime('%Y%m%d')
sw_temp_3.drop(columns=[' format: day'], inplace=True)
sw_temp_3.rename(columns={'value location:60_120 Start : 20250101 ': 'temp'},inplace=True)

# 컨캣
sw_gwonsun_pty = pd.concat([sw_temp_1, sw_temp_2, sw_temp_3], ignore_index=True)

# 시간합
h = (sw_gwonsun_pty['hour'] // 100).astype(int)

sw_gwonsun_pty['time_slot'] = h.map(hour_to_slot)
sw_gwonsun_pty.columns = ['시간', '강수형태', '기준년월일', '시간대']
sw_gwonsun_pty = sw_gwonsun_pty[['기준년월일', '시간대', '시간', '강수형태']]
sw_gwonsun_pty = (sw_gwonsun_pty.groupby(['기준년월일', '시간대'], as_index=False)['강수형태'].max())
sw_gwonsun_pty

8760 8760
8784 8784
7296 7296

          기준년월일  시간대  강수형태
0      20230101    1   0.0
1      20230101    2   0.0
2      20230101    3   0.0
3      20230101    4   0.0
4      20230101    5   0.0
...         ...  ...   ...
10345  20251031    6   1.0
10346  20251031    7   0.0
10347  20251031    8   0.0
10348  20251031    9   0.0
10349  20251031   10   0.0

[10350 rows x 3 columns]

### 팔달구 행궁동 강수형태

In [21]:
# 파일셋
sw_temp_1 = pd.read_csv('data/수원시 기상/행궁동_강수형태_202301_202312.csv')
sw_temp_2 = pd.read_csv('data/수원시 기상/행궁동_강수형태_202401_202412.csv')
sw_temp_3 = pd.read_csv('data/수원시 기상/행궁동_강수형태_202501_202510.csv')

# 날짜변환
mask = sw_temp_1[' format: day'].astype(str).str.contains('Start')
sw_temp_1 = sw_temp_1[~mask].reset_index(drop=True)
days_2023 = pd.date_range('2023-01-01', '2023-12-31', freq='D')
full_dates = days_2023.repeat(24) 
print(len(sw_temp_1), len(full_dates))
sw_temp_1['date'] = full_dates.strftime('%Y%m%d')
sw_temp_1.drop(columns=[' format: day'], inplace=True)
sw_temp_1.rename(columns={'value location:61_121 Start : 20230101 ': 'temp'},inplace=True)

mask = sw_temp_2[' format: day'].astype(str).str.contains('Start')
sw_temp_2 = sw_temp_2[~mask].reset_index(drop=True)
days_2024 = pd.date_range('2024-01-01', '2024-12-31', freq='D')
full_dates = days_2024.repeat(24) 
print(len(sw_temp_2), len(full_dates))
sw_temp_2['date'] = full_dates.strftime('%Y%m%d')
sw_temp_2.drop(columns=[' format: day'], inplace=True)
sw_temp_2.rename(columns={'value location:61_121 Start : 20240101 ': 'temp'},inplace=True)

mask = sw_temp_3[' format: day'].astype(str).str.contains('Start')
sw_temp_3 = sw_temp_3[~mask].reset_index(drop=True)
days_2025 = pd.date_range('2025-01-01', '2025-10-31', freq='D')
full_dates = days_2025.repeat(24) 
print(len(sw_temp_3), len(full_dates))
sw_temp_3['date'] = full_dates.strftime('%Y%m%d')
sw_temp_3.drop(columns=[' format: day'], inplace=True)
sw_temp_3.rename(columns={'value location:61_121 Start : 20250101 ': 'temp'},inplace=True)

# 컨캣
sw_paldal_pty = pd.concat([sw_temp_1, sw_temp_2, sw_temp_3], ignore_index=True)

# 시간합
h = (sw_paldal_pty['hour'] // 100).astype(int)

sw_paldal_pty['time_slot'] = h.map(hour_to_slot)
sw_paldal_pty.columns = ['시간', '강수형태', '기준년월일', '시간대']
sw_paldal_pty = sw_paldal_pty[['기준년월일', '시간대', '시간', '강수형태']]
sw_paldal_pty = (sw_paldal_pty.groupby(['기준년월일', '시간대'], as_index=False)['강수형태'].max())
sw_paldal_pty

8760 8760
8784 8784
7296 7296

          기준년월일  시간대  강수형태
0      20230101    1   0.0
1      20230101    2   0.0
2      20230101    3   0.0
3      20230101    4   0.0
4      20230101    5   0.0
...         ...  ...   ...
10345  20251031    6   1.0
10346  20251031    7   0.0
10347  20251031    8   0.0
10348  20251031    9   0.0
10349  20251031   10   0.0

[10350 rows x 3 columns]

### 영통구 원천동 강수형태

In [22]:
# 파일셋
sw_temp_1 = pd.read_csv('data/수원시 기상/원천동_강수형태_202301_202312.csv')
sw_temp_2 = pd.read_csv('data/수원시 기상/원천동_강수형태_202401_202412.csv')
sw_temp_3 = pd.read_csv('data/수원시 기상/원천동_강수형태_202501_202510.csv')

# 날짜변환
mask = sw_temp_1[' format: day'].astype(str).str.contains('Start')
sw_temp_1 = sw_temp_1[~mask].reset_index(drop=True)
days_2023 = pd.date_range('2023-01-01', '2023-12-31', freq='D')
full_dates = days_2023.repeat(24) 
print(len(sw_temp_1), len(full_dates))
sw_temp_1['date'] = full_dates.strftime('%Y%m%d')
sw_temp_1.drop(columns=[' format: day'], inplace=True)
sw_temp_1.rename(columns={'value location:61_120 Start : 20230101 ': 'temp'},inplace=True)

mask = sw_temp_2[' format: day'].astype(str).str.contains('Start')
sw_temp_2 = sw_temp_2[~mask].reset_index(drop=True)
days_2024 = pd.date_range('2024-01-01', '2024-12-31', freq='D')
full_dates = days_2024.repeat(24) 
print(len(sw_temp_2), len(full_dates))
sw_temp_2['date'] = full_dates.strftime('%Y%m%d')
sw_temp_2.drop(columns=[' format: day'], inplace=True)
sw_temp_2.rename(columns={'value location:61_120 Start : 20240101 ': 'temp'},inplace=True)

mask = sw_temp_3[' format: day'].astype(str).str.contains('Start')
sw_temp_3 = sw_temp_3[~mask].reset_index(drop=True)
days_2025 = pd.date_range('2025-01-01', '2025-10-31', freq='D')
full_dates = days_2025.repeat(24) 
print(len(sw_temp_3), len(full_dates))
sw_temp_3['date'] = full_dates.strftime('%Y%m%d')
sw_temp_3.drop(columns=[' format: day'], inplace=True)
sw_temp_3.rename(columns={'value location:61_120 Start : 20250101 ': 'temp'},inplace=True)

# 컨캣
sw_yeongtong_pty = pd.concat([sw_temp_1, sw_temp_2, sw_temp_3], ignore_index=True)

# 시간합
h = (sw_yeongtong_pty['hour'] // 100).astype(int)

sw_yeongtong_pty['time_slot'] = h.map(hour_to_slot)
sw_yeongtong_pty.columns = ['시간', '강수형태', '기준년월일', '시간대']
sw_yeongtong_pty = sw_yeongtong_pty[['기준년월일', '시간대', '시간', '강수형태']]
sw_yeongtong_pty = (sw_yeongtong_pty.groupby(['기준년월일', '시간대'], as_index=False)['강수형태'].max())
sw_yeongtong_pty

8760 8760
8784 8784
7296 7296

          기준년월일  시간대  강수형태
0      20230101    1   0.0
1      20230101    2   0.0
2      20230101    3   0.0
3      20230101    4   0.0
4      20230101    5   0.0
...         ...  ...   ...
10345  20251031    6   1.0
10346  20251031    7   0.0
10347  20251031    8   0.0
10348  20251031    9   0.0
10349  20251031   10   0.0

[10350 rows x 3 columns]

## 기온,강수량, 강수형태

In [23]:
sw_gwonsun = pd.merge(sw_gwonsun_temp, sw_gwonsun_rain, on=['기준년월일', '시간대'], how='left')
sw_gwonsun = pd.merge(sw_gwonsun, sw_gwonsun_pty, on=['기준년월일', '시간대'], how='left')
sw_gwonsun.columns = ['TA_YMD','HOUR','TEMP','RAIN','R_GRADE']
sw_gwonsun

         TA_YMD  HOUR   TEMP  RAIN  R_GRADE
0      20230101     1   2.10   0.0      0.0
1      20230101     2  -0.20   0.0      0.0
2      20230101     3  -2.25   0.0      0.0
3      20230101     4  -3.20   0.0      0.0
4      20230101     5  -4.10   0.0      0.0
...         ...   ...    ...   ...      ...
10345  20251031     6  11.65   1.5      1.0
10346  20251031     7  11.65   0.0      0.0
10347  20251031     8  10.70   0.0      0.0
10348  20251031     9   9.35   0.0      0.0
10349  20251031    10  12.00   0.0      0.0

[10350 rows x 5 columns]

In [24]:
sw_jangan = pd.merge(sw_jangan_temp, sw_jangan_rain, on=['기준년월일', '시간대'], how='left')
sw_jangan = pd.merge(sw_jangan, sw_jangan_pty, on=['기준년월일', '시간대'], how='left')
sw_jangan.columns = ['TA_YMD','HOUR','TEMP','RAIN','R_GRADE']
sw_jangan

         TA_YMD  HOUR   TEMP  RAIN  R_GRADE
0      20230101     1   2.10   0.0      0.0
1      20230101     2  -0.20   0.0      0.0
2      20230101     3  -2.25   0.0      0.0
3      20230101     4  -3.20   0.0      0.0
4      20230101     5  -4.10   0.0      0.0
...         ...   ...    ...   ...      ...
10345  20251031     6  11.65   1.5      1.0
10346  20251031     7  11.65   0.0      0.0
10347  20251031     8  10.70   0.0      0.0
10348  20251031     9   9.35   0.0      0.0
10349  20251031    10  12.00   0.0      0.0

[10350 rows x 5 columns]

In [25]:
sw_paldal = pd.merge(sw_paldal_temp, sw_paldal_rain, on=['기준년월일', '시간대'], how='left')
sw_paldal = pd.merge(sw_paldal, sw_paldal_pty, on=['기준년월일', '시간대'], how='left')
sw_paldal.columns = ['TA_YMD','HOUR','TEMP','RAIN','R_GRADE']
sw_paldal

         TA_YMD  HOUR   TEMP  RAIN  R_GRADE
0      20230101     1   2.10   0.0      0.0
1      20230101     2  -0.20   0.0      0.0
2      20230101     3  -2.25   0.0      0.0
3      20230101     4  -3.20   0.0      0.0
4      20230101     5  -4.10   0.0      0.0
...         ...   ...    ...   ...      ...
10345  20251031     6  11.65   1.5      1.0
10346  20251031     7  11.65   0.0      0.0
10347  20251031     8  10.70   0.0      0.0
10348  20251031     9   9.35   0.0      0.0
10349  20251031    10  12.00   0.0      0.0

[10350 rows x 5 columns]

In [26]:
sw_yeongtong = pd.merge(sw_yeongtong_temp, sw_yeongtong_rain, on=['기준년월일', '시간대'], how='left')
sw_yeongtong = pd.merge(sw_yeongtong, sw_yeongtong_pty, on=['기준년월일', '시간대'], how='left')
sw_yeongtong.columns = ['TA_YMD','HOUR','TEMP','RAIN','R_GRADE']
sw_yeongtong

         TA_YMD  HOUR   TEMP  RAIN  R_GRADE
0      20230101     1   2.10   0.0      0.0
1      20230101     2  -0.20   0.0      0.0
2      20230101     3  -2.25   0.0      0.0
3      20230101     4  -3.20   0.0      0.0
4      20230101     5  -4.10   0.0      0.0
...         ...   ...    ...   ...      ...
10345  20251031     6  11.65   1.5      1.0
10346  20251031     7  11.65   0.0      0.0
10347  20251031     8  10.70   0.0      0.0
10348  20251031     9   9.35   0.0      0.0
10349  20251031    10  12.00   0.0      0.0

[10350 rows x 5 columns]

## 동 전체 기온, 강수량

In [23]:
%%time
import os
import glob
import re
import pandas as pd

# =========================
# 동 리스트(44개)
# =========================
DONG_LIST = [
    "파장동","율천동","정자1동","정자2동","정자3동","영화동","송죽동","조원1동","조원2동","연무동",
    "세류1동","세류2동","세류3동","평동","서둔동","구운동","금곡동","호매실동","권선1동","권선2동",
    "곡선동","입북동","매교동","매산동","고등동","화서1동","화서2동","지동","우만1동","우만2동",
    "인계동","행궁동","매탄1동","매탄2동","매탄3동","매탄4동","원천동","영통1동","영통2동",
    "영통3동","망포1동","망포2동","광교1동","광교2동",
]

BASE_DIR = "data/수원시 동 기상"   # 폴더

# =========================
# 유틸: temp 컬럼 자동 찾기
# =========================
def detect_temp_col(df: pd.DataFrame) -> str:
    cands = [c for c in df.columns if str(c).strip().lower().startswith("value location")]
    if cands:
        return cands[0]
    if "temp" in df.columns:
        return "temp"
    raise ValueError(f"temp 컬럼을 찾지 못함. columns={list(df.columns)[:15]} ...")

# =========================
# 유틸: 연월 → 말일
# =========================
def last_day_of_month(ym: str) -> str:
    dt = pd.to_datetime(ym + "01", format="%Y%m%d")
    last = dt + pd.offsets.MonthEnd(1)
    return last.strftime("%Y%m%d")

# =========================
# 유틸: date 만들기 + end_ymd 컷
# =========================
def add_date_by_rowcount_with_end(df: pd.DataFrame, start_ymd: str, end_ymd: str):
    start_dt = pd.to_datetime(start_ymd, format="%Y%m%d")
    end_dt   = pd.to_datetime(end_ymd, format="%Y%m%d")

    n_days = len(df) // 24
    if n_days * 24 != len(df):
        raise ValueError(f"행 수가 24의 배수가 아님: rows={len(df)}")

    days = pd.date_range(start_dt, periods=n_days, freq="D")
    full_dates = days.repeat(24)

    df = df.copy()
    df["date"] = full_dates

    # 🔥 파일 종료 연월 기준 컷
    df = df[df["date"] <= end_dt]

    df["date"] = df["date"].dt.strftime("%Y%m%d")
    return df.reset_index(drop=True)

# =========================
# 핵심: 동 하나의 모든 기온 파일 읽어 합치기
# =========================
def load_one_dong_temp(dong: str) -> pd.DataFrame:
    pattern = os.path.join(BASE_DIR, f"{dong}_기온_*.csv")
    files = sorted(glob.glob(pattern))

    if not files:
        print(f"[WARN] 파일 없음: {dong} ({pattern})")
        return pd.DataFrame()

    parts = []
    for fp in files:
        df = pd.read_csv(fp)

        # 1) Start 행 제거
        if " format: day" in df.columns:
            mask = df[" format: day"].astype(str).str.contains("Start", na=False)
            df = df[~mask].reset_index(drop=True)
            df = df.drop(columns=[" format: day"], errors="ignore")

        # 2) temp 컬럼 통일
        temp_col = detect_temp_col(df)
        df = df.rename(columns={temp_col: "temp"})

        # 3) 파일명에서 시작/종료 연월 파싱
        m = re.search(r"_(\d{6})_(\d{6})\.csv$", os.path.basename(fp))
        if not m:
            raise ValueError(f"파일명에서 기간을 파싱 못함: {fp}")

        start_ym = m.group(1)  # 예: 202301
        end_ym   = m.group(2)  # 예: 202510

        start_ymd = start_ym + "01"
        end_ymd   = last_day_of_month(end_ym)

        # 4) date 생성 + 종료일 컷
        df = add_date_by_rowcount_with_end(df, start_ymd, end_ymd)

        # 5) DONG 추가
        df["DONG"] = dong

        parts.append(df)

    out = pd.concat(parts, ignore_index=True)

    # 필요한 컬럼만 유지
    keep = [c for c in ["DONG", "date", "hour", "temp"] if c in out.columns]
    out = out[keep].copy()

    return out

# =========================
# ✅ 44개 동 한꺼번에 로드
# =========================
all_dfs = []
for dong in DONG_LIST:
    df_d = load_one_dong_temp(dong)
    if not df_d.empty:
        all_dfs.append(df_d)

sw_temp = pd.concat(all_dfs, ignore_index=True)

print("[DONE] sw_temp rows:", len(sw_temp))
print(sw_temp.head())

# =========================
# 시간대 슬롯 생성
# =========================
sw_temp["hour_int"] = (sw_temp["hour"] // 100).astype(int)
sw_temp["HOUR"] = sw_temp["hour_int"].apply(hour_to_slot)

[DONE] sw_temp rows: 1092960
  DONG      date   hour  temp
0  파장동  20230101    0.0   0.1
1  파장동  20230101  100.0   1.2
2  파장동  20230101  200.0   2.2
3  파장동  20230101  300.0   3.2
4  파장동  20230101  400.0   3.0
CPU times: total: 6.92 s
Wall time: 6.92 s

In [22]:
%%time

import os
import glob
import re
import pandas as pd

# =========================
# 동 리스트(44개)
# =========================
DONG_LIST = [
    "파장동","율천동","정자1동","정자2동","정자3동","영화동","송죽동","조원1동","조원2동","연무동",
    "세류1동","세류2동","세류3동","평동","서둔동","구운동","금곡동","호매실동","권선1동","권선2동",
    "곡선동","입북동","매교동","매산동","고등동","화서1동","화서2동","지동","우만1동","우만2동",
    "인계동","행궁동","매탄1동","매탄2동","매탄3동","매탄4동","원천동","영통1동","영통2동",
    "영통3동","망포1동","망포2동","광교1동","광교2동",
]

BASE_DIR = "data/수원시 동 기상"

# =========================
# rain 컬럼 탐색
# =========================
def detect_rain_col(df: pd.DataFrame) -> str:
    cands = [c for c in df.columns if str(c).strip().lower().startswith("value location")]
    if cands:
        return cands[0]
    if "rain" in df.columns:
        return "rain"
    raise ValueError("rain 컬럼을 찾지 못함")

# =========================
# 연월 → 말일
# =========================
def last_day_of_month(ym: str) -> str:
    dt = pd.to_datetime(ym + "01", format="%Y%m%d")
    return (dt + pd.offsets.MonthEnd(1)).strftime("%Y%m%d")

# =========================
# hour 롤오버 기반 date 생성 (강수 전용)
# =========================
def add_date_by_hour_rollover(df: pd.DataFrame, start_ymd: str, end_ymd: str):
    df = df.copy()

    start_dt = pd.to_datetime(start_ymd, format="%Y%m%d")
    end_dt   = pd.to_datetime(end_ymd, format="%Y%m%d")

    # 🔥 hour 완전 정규화 (문자열/float/NaN 전부 대응)
    df["hour"] = (
        pd.to_numeric(df["hour"], errors="coerce")
        .fillna(0)
        .astype(int)
    )

    dates = []
    cur_date = start_dt
    prev_hour = None

    for h in df["hour"]:
        if prev_hour is not None and h < prev_hour:
            cur_date += pd.Timedelta(days=1)
        dates.append(cur_date)
        prev_hour = h

    df["date"] = pd.to_datetime(dates)

    # 종료일 컷
    df = df[df["date"] <= end_dt]

    df["date"] = df["date"].dt.strftime("%Y%m%d")
    return df.reset_index(drop=True)

# =========================
# 동 하나의 강수 데이터 로드
# =========================
def load_one_dong_rain(dong: str) -> pd.DataFrame:
    pattern = os.path.join(BASE_DIR, f"{dong}_강수_*.csv")
    files = sorted(glob.glob(pattern))

    if not files:
        print(f"[WARN] 파일 없음: {dong}")
        return pd.DataFrame()

    parts = []

    for fp in files:
        df = pd.read_csv(fp)

        # Start 행 제거
        if " format: day" in df.columns:
            df = df[~df[" format: day"].astype(str).str.contains("Start", na=False)]
            df = df.drop(columns=[" format: day"], errors="ignore")

        # rain 컬럼 통일
        rain_col = detect_rain_col(df)
        df = df.rename(columns={rain_col: "rain"})

        # 파일명 기간 파싱
        m = re.search(r"_(\d{6})_(\d{6})\.csv$", os.path.basename(fp))
        if not m:
            raise ValueError(f"파일명 파싱 실패: {fp}")

        start_ymd = m.group(1) + "01"
        end_ymd   = last_day_of_month(m.group(2))

        # date 생성
        df = add_date_by_hour_rollover(df, start_ymd, end_ymd)

        df["DONG"] = dong
        parts.append(df)

    out = pd.concat(parts, ignore_index=True)
    return out[["DONG", "date", "hour", "rain"]]

# =========================
# 전체 동 로드
# =========================
all_dfs = []
for dong in DONG_LIST:
    df_d = load_one_dong_rain(dong)
    if not df_d.empty:
        all_dfs.append(df_d)

sw_rain = pd.concat(all_dfs, ignore_index=True)

print("[DONE] sw_rain rows:", len(sw_rain))
print(sw_rain.head())

# =========================
# 시간대 슬롯 생성
# =========================
sw_rain["hour_int"] = (sw_rain["hour"] // 100).astype(int)
sw_rain["HOUR"] = sw_rain["hour_int"].apply(hour_to_slot)

[DONE] sw_rain rows: 1092960
  DONG      date  hour rain
0  파장동  20230101     0  0.0
1  파장동  20230101   100  0.0
2  파장동  20230101   200  0.0
3  파장동  20230101   300  0.0
4  파장동  20230101   400  0.0
CPU times: total: 12.1 s
Wall time: 12.1 s

In [26]:
sw_temp['TA_YMD'] = sw_temp['date'].astype('int64')
sw_rain['TA_YMD'] = sw_rain['date'].astype('int64')
sw_temp = sw_temp.drop(['date'], axis=1)
sw_rain = sw_rain.drop(['date'], axis=1)

In [27]:
sw_rain['rain'] = sw_rain['rain'].astype('float32')

In [31]:
sw_rain.drop(['hour_int', 'hour'], axis=1, inplace=True)
sw_temp.drop(['hour_int', 'hour'], axis=1, inplace=True)

In [34]:
sw_temp.columns = ['DONG','TEMP', 'HOUR', 'TA_YMD']
sw_rain.columns = ['DONG','RAIN', 'HOUR', 'TA_YMD']

         DONG  RAIN  HOUR    TA_YMD
0         파장동   0.0     1  20230101
1         파장동   0.0     1  20230101
2         파장동   0.0     1  20230101
3         파장동   0.0     1  20230101
4         파장동   0.0     1  20230101
...       ...   ...   ...       ...
1092955  광교2동   0.0     8  20251031
1092956  광교2동   0.0     8  20251031
1092957  광교2동   0.0     9  20251031
1092958  광교2동   0.0     9  20251031
1092959  광교2동   0.0    10  20251031

[1092960 rows x 4 columns]

# 종합

In [19]:
sw_data = pd.read_csv('c:/Users/Admin/AI/downloads/카드소비데이터 수원시/SUWON_S_DATA_TABLE.csv')
sw_data = sw_data.sort_values(['TA_YMD','HOUR']).reset_index(drop=True)
sw_data_sum = sw_data.groupby(['TA_YMD','DONG', 'HOUR', 'DAY'], as_index=False).agg({
    'AGE': 'sum',    
    'AMT': 'sum',    
    'CNT': 'sum',   
    'UNIT': 'mean',  
    'TEMP': 'mean',   
    'RAIN': 'mean'   
})
sw_data_sum.drop(['AGE', 'UNIT'], inplace=True, axis=1)
sw_data_sum

          TA_YMD  DONG  HOUR  DAY      AMT  CNT   TEMP  RAIN
0       20230101   고등동     1    7    65063    7   2.10   0.0
1       20230101   고등동     2    7    14878    4  -0.20   0.0
2       20230101   고등동     3    7    77671   20  -2.25   0.0
3       20230101   고등동     4    7   452897   52  -3.20   0.0
4       20230101   고등동     5    7   972179   92  -4.10   0.0
...          ...   ...   ...  ...      ...  ...    ...   ...
101508  20251031  화서2동     6    5   886440  155  11.65   1.5
101509  20251031  화서2동     7    5  1319747  105  11.65   0.0
101510  20251031  화서2동     8    5  3662364  125  10.70   0.0
101511  20251031  화서2동     9    5  1999679   51   9.35   0.0
101512  20251031  화서2동    10    5    33534   11  12.00   0.0

[101513 rows x 8 columns]

In [17]:
sw_data_sum = sw_data_sum.sort_values(['TA_YMD', 'DONG', 'HOUR'])

          TA_YMD  DONG  HOUR  DAY      AMT  CNT          UNIT   TEMP  RAIN
0       20230101   고등동     1    7    65063    7  11650.000000   2.10   0.0
1       20230101   고등동     2    7    14878    4   3719.500000  -0.20   0.0
2       20230101   고등동     3    7    77671   20   3994.400000  -2.25   0.0
3       20230101   고등동     4    7   452897   52   8561.200000  -3.20   0.0
4       20230101   고등동     5    7   972179   92  10032.142857  -4.10   0.0
...          ...   ...   ...  ...      ...  ...           ...    ...   ...
101508  20251031  화서2동     6    5   886440  155   5864.250000  11.65   1.5
101509  20251031  화서2동     7    5  1319747  105  10592.666667  11.65   0.0
101510  20251031  화서2동     8    5  3662364  125  23087.666667  10.70   0.0
101511  20251031  화서2동     9    5  1999679   51  32272.600000   9.35   0.0
101512  20251031  화서2동    10    5    33534   11   3042.000000  12.00   0.0

[101513 rows x 9 columns]

In [22]:
sw_data_sum['UNIT'] = pd.to_numeric((sw_data_sum['AMT']/sw_data_sum['CNT']).round(),errors='coerce').fillna(0).astype('int64')
sw_data_sum = sw_data_sum[sw_data_sum['RAIN']>=0].reset_index(drop=True)
sw_data_sum = sw_data_sum[['TA_YMD','HOUR','DAY','DONG','AMT','CNT','UNIT','TEMP','RAIN']]
sw_data_sum

          TA_YMD  HOUR  DAY  DONG      AMT  CNT   UNIT   TEMP  RAIN
0       20230101     1    7   고등동    65063    7   9295   2.10   0.0
1       20230101     2    7   고등동    14878    4   3720  -0.20   0.0
2       20230101     3    7   고등동    77671   20   3884  -2.25   0.0
3       20230101     4    7   고등동   452897   52   8710  -3.20   0.0
4       20230101     5    7   고등동   972179   92  10567  -4.10   0.0
...          ...   ...  ...   ...      ...  ...    ...    ...   ...
101508  20251031     6    5  화서2동   886440  155   5719  11.65   1.5
101509  20251031     7    5  화서2동  1319747  105  12569  11.65   0.0
101510  20251031     8    5  화서2동  3662364  125  29299  10.70   0.0
101511  20251031     9    5  화서2동  1999679   51  39209   9.35   0.0
101512  20251031    10    5  화서2동    33534   11   3049  12.00   0.0

[101513 rows x 9 columns]

In [32]:
sw_data_sum.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 101513 entries, 0 to 101512
Data columns (total 9 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   TA_YMD  101513 non-null  int64
 1   HOUR    101513 non-null  int64
 2   DAY     101513 non-null  int64
 3   DONG    101513 non-null  object
 4   AMT     101513 non-null  int64
 5   CNT     101513 non-null  int64
 6   UNIT    101513 non-null  int64
 7   TEMP    101513 non-null  float64
 8   RAIN    101513 non-null  float64
dtypes: float64(2), int64(6), object(1)
memory usage: 7.0+ MB

## 배달, 한식 종합

In [53]:
# 1. 장안구
mask_jangan = sw_koreanfood['DONG'].str.contains('수원시 장안구', na=False)
keys_jangan = sw_koreanfood[mask_jangan][['TA_YMD', 'HOUR']]
jangan_merged = keys_jangan.merge(sw_jangan[['TA_YMD', 'HOUR', 'TEMP', 'RAIN', 'R_GRADE']], 
                                 on=['TA_YMD', 'HOUR'], how='left')
sw_koreanfood.loc[mask_jangan, ['TEMP', 'RAIN', 'R_GRADE']] = jangan_merged[['TEMP', 'RAIN', 'R_GRADE']].values

# 2. 팔달구
mask_paldal = sw_koreanfood['DONG'].str.contains('수원시 팔달구', na=False)
keys_paldal = sw_koreanfood[mask_paldal][['TA_YMD', 'HOUR']]
paldal_merged = keys_paldal.merge(sw_paldal[['TA_YMD', 'HOUR', 'TEMP', 'RAIN', 'R_GRADE']], 
                                 on=['TA_YMD', 'HOUR'], how='left')
sw_koreanfood.loc[mask_paldal, ['TEMP', 'RAIN', 'R_GRADE']] = paldal_merged[['TEMP', 'RAIN', 'R_GRADE']].values

# 3. 권선구
mask_gwonsun = sw_koreanfood['DONG'].str.contains('수원시 권선구', na=False)
keys_gwonsun = sw_koreanfood[mask_gwonsun][['TA_YMD', 'HOUR']]
gwonsun_merged = keys_gwonsun.merge(sw_gwonsun[['TA_YMD', 'HOUR', 'TEMP', 'RAIN', 'R_GRADE']], 
                                   on=['TA_YMD', 'HOUR'], how='left')
sw_koreanfood.loc[mask_gwonsun, ['TEMP', 'RAIN', 'R_GRADE']] = gwonsun_merged[['TEMP', 'RAIN', 'R_GRADE']].values

# 4. 영통구
mask_yeongtong = sw_koreanfood['DONG'].str.contains('수원시 영통구', na=False)
keys_yeongtong = sw_koreanfood[mask_yeongtong][['TA_YMD', 'HOUR']]
yeongtong_merged = keys_yeongtong.merge(sw_yeongtong[['TA_YMD', 'HOUR', 'TEMP', 'RAIN', 'R_GRADE']], 
                                       on=['TA_YMD', 'HOUR'], how='left')
sw_koreanfood.loc[mask_yeongtong, ['TEMP', 'RAIN', 'R_GRADE']] = yeongtong_merged[['TEMP', 'RAIN', 'R_GRADE']].values

In [41]:
sw_gwonsun['TA_YMD'] = sw_gwonsun['TA_YMD'].astype('int64')
sw_jangan['TA_YMD'] = sw_jangan['TA_YMD'].astype('int64')
sw_paldal['TA_YMD'] = sw_paldal['TA_YMD'].astype('int64')
sw_yeongtong['TA_YMD'] = sw_yeongtong['TA_YMD'].astype('int64')
sw_gwonsun.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10350 entries, 0 to 10349
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   TA_YMD   10350 non-null  int64
 1   HOUR     10350 non-null  int64
 2   TEMP     10350 non-null  float64
 3   RAIN     10350 non-null  float64
 4   R_GRADE  10350 non-null  float64
dtypes: float64(3), int64(2)
memory usage: 485.2 KB

In [54]:
sw_koreanfood

,TA_YMD,DONG,HOUR,DAY,AMT,CNT,UNIT,TEMP,RAIN,R_GRADE
0,20230101,수원시 장안구 파장동,1,7,987830,17,58108,2.10,0.0,0.0
1,20230101,수원시 장안구 파장동,2,7,516279,20,25814,-0.20,0.0,0.0
2,20230101,수원시 장안구 파장동,3,7,2220711,76,29220,-2.25,0.0,0.0
3,20230101,수원시 장안구 파장동,4,7,9419194,230,40953,-3.20,0.0,0.0
4,20230101,수원시 장안구 파장동,5,7,17829061,364,48981,-4.10,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...
443518,20251031,수원시 영통구 광교2동,6,5,1624413,106,15325,11.65,1.5,1.0
443519,20251031,수원시 영통구 광교2동,7,5,6841204,185,36979,11.65,0.0,0.0
443520,20251031,수원시 영통구 광교2동,8,5,10899392,188,57975,10.70,0.0,0.0
443521,20251031,수원시 영통구 광교2동,9,5,4432221,62,71487,9.35,0.0,0.0
443522,20251031,수원시 영통구 광교2동,10,5,828374,17,48728,12.00,0.0,0.0

In [56]:
# 1. 장안구
mask_jangan = sw_delivery['DONG'].str.contains('수원시 장안구', na=False)
keys_jangan = sw_delivery[mask_jangan][['TA_YMD', 'HOUR']]
jangan_merged = keys_jangan.merge(sw_jangan[['TA_YMD', 'HOUR', 'TEMP', 'RAIN', 'R_GRADE']], 
                                 on=['TA_YMD', 'HOUR'], how='left')
sw_delivery.loc[mask_jangan, ['TEMP', 'RAIN', 'R_GRADE']] = jangan_merged[['TEMP', 'RAIN', 'R_GRADE']].values

# 2. 팔달구
mask_paldal = sw_delivery['DONG'].str.contains('수원시 팔달구', na=False)
keys_paldal = sw_delivery[mask_paldal][['TA_YMD', 'HOUR']]
paldal_merged = keys_paldal.merge(sw_paldal[['TA_YMD', 'HOUR', 'TEMP', 'RAIN', 'R_GRADE']], 
                                 on=['TA_YMD', 'HOUR'], how='left')
sw_delivery.loc[mask_paldal, ['TEMP', 'RAIN', 'R_GRADE']] = paldal_merged[['TEMP', 'RAIN', 'R_GRADE']].values

# 3. 권선구
mask_gwonsun = sw_delivery['DONG'].str.contains('수원시 권선구', na=False)
keys_gwonsun = sw_delivery[mask_gwonsun][['TA_YMD', 'HOUR']]
gwonsun_merged = keys_gwonsun.merge(sw_gwonsun[['TA_YMD', 'HOUR', 'TEMP', 'RAIN', 'R_GRADE']], 
                                   on=['TA_YMD', 'HOUR'], how='left')
sw_delivery.loc[mask_gwonsun, ['TEMP', 'RAIN', 'R_GRADE']] = gwonsun_merged[['TEMP', 'RAIN', 'R_GRADE']].values

# 4. 영통구
mask_yeongtong = sw_delivery['DONG'].str.contains('수원시 영통구', na=False)
keys_yeongtong = sw_delivery[mask_yeongtong][['TA_YMD', 'HOUR']]
yeongtong_merged = keys_yeongtong.merge(sw_yeongtong[['TA_YMD', 'HOUR', 'TEMP', 'RAIN', 'R_GRADE']], 
                                       on=['TA_YMD', 'HOUR'], how='left')
sw_delivery.loc[mask_yeongtong, ['TEMP', 'RAIN', 'R_GRADE']] = yeongtong_merged[['TEMP', 'RAIN', 'R_GRADE']].values

In [57]:
sw_delivery

,TA_YMD,DONG,HOUR,DAY,AMT,CNT,UNIT,TEMP,RAIN,R_GRADE
0,20230101,수원시 장안구 정자3동,1,7,859721,15,57315,2.10,0.0,0.0
1,20230101,수원시 장안구 정자3동,9,7,109133,3,36378,-7.30,0.0,0.0
2,20230101,수원시 장안구 영화동,7,7,37152,2,18576,-6.40,0.0,0.0
3,20230101,수원시 장안구 영화동,8,7,31455,2,15728,-7.00,0.0,0.0
4,20230101,수원시 장안구 영화동,9,7,18576,2,9288,-7.30,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...
37761,20251031,수원시 영통구 광교1동,10,5,2359488,5,471898,12.00,0.0,0.0
37762,20251031,수원시 영통구 광교2동,4,5,270898,2,135449,14.75,0.0,0.0
37763,20251031,수원시 영통구 광교2동,5,5,37647,6,6274,13.55,0.1,1.0
37764,20251031,수원시 영통구 광교2동,6,5,247678,2,123839,11.65,1.5,1.0
37765,20251031,수원시 영통구 광교2동,7,5,11146,2,5573,11.65,0.0,0.0

In [6]:
sw_delivery['DONG'] = sw_delivery['DONG'].str.extract(r'(\S+동)$', expand=False)
sw_koreanfood['DONG'] = sw_koreanfood['DONG'].str.extract(r'(\S+동)$', expand=False)

In [42]:
# 1. 장안구
mask_jangan = sw_rest['DONG'].str.contains('수원시 장안구', na=False)
keys_jangan = sw_rest[mask_jangan][['TA_YMD', 'HOUR']]
jangan_merged = keys_jangan.merge(sw_jangan[['TA_YMD', 'HOUR', 'TEMP', 'RAIN', 'R_GRADE']], 
                                 on=['TA_YMD', 'HOUR'], how='left')
sw_rest.loc[mask_jangan, ['TEMP', 'RAIN', 'R_GRADE']] = jangan_merged[['TEMP', 'RAIN', 'R_GRADE']].values

# 2. 팔달구
mask_paldal = sw_rest['DONG'].str.contains('수원시 팔달구', na=False)
keys_paldal = sw_rest[mask_paldal][['TA_YMD', 'HOUR']]
paldal_merged = keys_paldal.merge(sw_paldal[['TA_YMD', 'HOUR', 'TEMP', 'RAIN', 'R_GRADE']], 
                                 on=['TA_YMD', 'HOUR'], how='left')
sw_rest.loc[mask_paldal, ['TEMP', 'RAIN', 'R_GRADE']] = paldal_merged[['TEMP', 'RAIN', 'R_GRADE']].values

# 3. 권선구
mask_gwonsun = sw_rest['DONG'].str.contains('수원시 권선구', na=False)
keys_gwonsun = sw_rest[mask_gwonsun][['TA_YMD', 'HOUR']]
gwonsun_merged = keys_gwonsun.merge(sw_gwonsun[['TA_YMD', 'HOUR', 'TEMP', 'RAIN', 'R_GRADE']], 
                                   on=['TA_YMD', 'HOUR'], how='left')
sw_rest.loc[mask_gwonsun, ['TEMP', 'RAIN', 'R_GRADE']] = gwonsun_merged[['TEMP', 'RAIN', 'R_GRADE']].values

# 4. 영통구
mask_yeongtong = sw_rest['DONG'].str.contains('수원시 영통구', na=False)
keys_yeongtong = sw_rest[mask_yeongtong][['TA_YMD', 'HOUR']]
yeongtong_merged = keys_yeongtong.merge(sw_yeongtong[['TA_YMD', 'HOUR', 'TEMP', 'RAIN', 'R_GRADE']], 
                                       on=['TA_YMD', 'HOUR'], how='left')
sw_rest.loc[mask_yeongtong, ['TEMP', 'RAIN', 'R_GRADE']] = yeongtong_merged[['TEMP', 'RAIN', 'R_GRADE']].values

In [43]:
# 1. 장안구
mask_jangan = sw_bakery['DONG'].str.contains('수원시 장안구', na=False)
keys_jangan = sw_bakery[mask_jangan][['TA_YMD', 'HOUR']]
jangan_merged = keys_jangan.merge(sw_jangan[['TA_YMD', 'HOUR', 'TEMP', 'RAIN', 'R_GRADE']], 
                                 on=['TA_YMD', 'HOUR'], how='left')
sw_bakery.loc[mask_jangan, ['TEMP', 'RAIN', 'R_GRADE']] = jangan_merged[['TEMP', 'RAIN', 'R_GRADE']].values

# 2. 팔달구
mask_paldal = sw_bakery['DONG'].str.contains('수원시 팔달구', na=False)
keys_paldal = sw_bakery[mask_paldal][['TA_YMD', 'HOUR']]
paldal_merged = keys_paldal.merge(sw_paldal[['TA_YMD', 'HOUR', 'TEMP', 'RAIN', 'R_GRADE']], 
                                 on=['TA_YMD', 'HOUR'], how='left')
sw_bakery.loc[mask_paldal, ['TEMP', 'RAIN', 'R_GRADE']] = paldal_merged[['TEMP', 'RAIN', 'R_GRADE']].values

# 3. 권선구
mask_gwonsun = sw_bakery['DONG'].str.contains('수원시 권선구', na=False)
keys_gwonsun = sw_bakery[mask_gwonsun][['TA_YMD', 'HOUR']]
gwonsun_merged = keys_gwonsun.merge(sw_gwonsun[['TA_YMD', 'HOUR', 'TEMP', 'RAIN', 'R_GRADE']], 
                                   on=['TA_YMD', 'HOUR'], how='left')
sw_bakery.loc[mask_gwonsun, ['TEMP', 'RAIN', 'R_GRADE']] = gwonsun_merged[['TEMP', 'RAIN', 'R_GRADE']].values

# 4. 영통구
mask_yeongtong = sw_bakery['DONG'].str.contains('수원시 영통구', na=False)
keys_yeongtong = sw_bakery[mask_yeongtong][['TA_YMD', 'HOUR']]
yeongtong_merged = keys_yeongtong.merge(sw_yeongtong[['TA_YMD', 'HOUR', 'TEMP', 'RAIN', 'R_GRADE']], 
                                       on=['TA_YMD', 'HOUR'], how='left')
sw_bakery.loc[mask_yeongtong, ['TEMP', 'RAIN', 'R_GRADE']] = yeongtong_merged[['TEMP', 'RAIN', 'R_GRADE']].values

In [44]:
sw_rest['DONG'] = sw_rest['DONG'].str.extract(r'(\S+동)$', expand=False)
sw_bakery['DONG'] = sw_bakery['DONG'].str.extract(r'(\S+동)$', expand=False)

C:\Users\Admin\AppData\Local\Temp\ipykernel_10336\2891058108.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sw_rest['DONG'] = sw_rest['DONG'].str.extract(r'(\S+동)$', expand=False)
C:\Users\Admin\AppData\Local\Temp\ipykernel_10336\2891058108.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sw_bakery['DONG'] = sw_bakery['DONG'].str.extract(r'(\S+동)$', expand=False)

In [45]:
sw_bakery

          TA_YMD  DONG  HOUR  DAY      AMT  CNT   UNIT   TEMP  RAIN  R_GRADE
0       20230101   파장동     2    7   104027    8  13003  -0.20   0.0      0.0
1       20230101   파장동     3    7  1514656   93  16287  -2.25   0.0      0.0
2       20230101   파장동     4    7  3275213  122  26846  -3.20   0.0      0.0
3       20230101   파장동     5    7  5897657  230  25642  -4.10   0.0      0.0
4       20230101   파장동     6    7  5514490  234  23566  -5.35   0.0      0.0
...          ...   ...   ...  ...      ...  ...    ...    ...   ...      ...
409938  20251031  광교2동     6    5   969515   90  10772  11.65   1.5      1.0
409939  20251031  광교2동     7    5   836033   68  12295  11.65   0.0      0.0
409940  20251031  광교2동     8    5   471121   47  10024  10.70   0.0      0.0
409941  20251031  광교2동     9    5   137847   11  12532   9.35   0.0      0.0
409942  20251031  광교2동    10    5     5875    2   2938  12.00   0.0      0.0

[409943 rows x 10 columns]

In [46]:
sw_rest

         TA_YMD  DONG  HOUR  DAY     AMT  CNT   UNIT   TEMP  RAIN  R_GRADE
0      20230101  권선2동     4    7   16633    4   4158  -3.20   0.0      0.0
1      20230101  권선2동     6    7    7740    2   3870  -5.35   0.0      0.0
2      20230101   인계동     2    7   15588    2   7794  -0.20   0.0      0.0
3      20230101   인계동     3    7   92770   14   6626  -2.25   0.0      0.0
4      20230101   인계동     4    7   51548    9   5728  -3.20   0.0      0.0
...         ...   ...   ...  ...     ...  ...    ...    ...   ...      ...
45749  20251031  광교2동     3    5   29954    2  14977  15.10   0.0      0.0
45750  20251031  광교2동     4    5  637817   59  10810  14.75   0.0      0.0
45751  20251031  광교2동     5    5  452522   38  11908  13.55   0.1      1.0
45752  20251031  광교2동     6    5   18800    3   6267  11.65   1.5      1.0
45753  20251031  광교2동     7    5   29766    4   7442  11.65   0.0      0.0

[45754 rows x 10 columns]

In [6]:
sw_koreanfood = sw_koreanfood.drop(['TEMP','RAIN','R_GRADE'], axis=1)
sw_koreanfood

          TA_YMD  DONG  HOUR  DAY       AMT  CNT   UNIT
0       20230101   파장동     1    7    987830   17  58108
1       20230101   파장동     2    7    516279   20  25814
2       20230101   파장동     3    7   2220711   76  29220
3       20230101   파장동     4    7   9419194  230  40953
4       20230101   파장동     5    7  17829061  364  48981
...          ...   ...   ...  ...       ...  ...    ...
443518  20251031  광교2동     6    5   1624413  106  15325
443519  20251031  광교2동     7    5   6841204  185  36979
443520  20251031  광교2동     8    5  10899392  188  57975
443521  20251031  광교2동     9    5   4432221   62  71487
443522  20251031  광교2동    10    5    828374   17  48728

[443523 rows x 7 columns]

In [39]:
# unique 값 추출
dong_k = set(sw_koreanfood["DONG"].dropna().unique())
dong_t = set(sw_temp["DONG"].dropna().unique())

# 완전 일치 여부
dong_k == dong_t

True

In [40]:
# unique 값 추출
dong_k = set(sw_koreanfood["DONG"].dropna().unique())
dong_t = set(sw_rain["DONG"].dropna().unique())

# 완전 일치 여부
dong_k == dong_t

True

In [48]:
import pandas as pd

KEYS = ["TA_YMD", "DONG", "HOUR"]

# 0) 타입/문자 정리 (필수: 키 타입 불일치로 매칭 안 되는 것 방지)
sw_koreanfood["TA_YMD"] = sw_koreanfood["TA_YMD"].astype("int64")
sw_koreanfood["HOUR"]   = sw_koreanfood["HOUR"].astype("int64")
sw_koreanfood["DONG"]   = sw_koreanfood["DONG"].astype(str).str.strip()

sw_temp["TA_YMD"] = sw_temp["TA_YMD"].astype("int64")
sw_temp["HOUR"]   = sw_temp["HOUR"].astype("int64")
sw_temp["DONG"]   = sw_temp["DONG"].astype(str).str.strip()

sw_rain["TA_YMD"] = sw_rain["TA_YMD"].astype("int64")
sw_rain["HOUR"]   = sw_rain["HOUR"].astype("int64")
sw_rain["DONG"]   = sw_rain["DONG"].astype(str).str.strip()

# 1) temp/rain 키 중복 제거(집계) -> 1키=1행 만들기
#    TEMP: 같은 슬롯 내 평균(원하면 max/min 등으로 바꿔도 됨)
temp_agg = (sw_temp
            .groupby(KEYS, as_index=False)["TEMP"]
            .mean())

#    RAIN: 같은 슬롯 내 평균 (원하면 sum/max 등으로 바꿔도 됨)
rain_agg = (sw_rain
            .groupby(KEYS, as_index=False)["RAIN"]
            .mean())

# 2) sw_koreanfood 기준 LEFT MERGE (행 수 유지)
n0 = len(sw_koreanfood)

out = sw_koreanfood.merge(
    temp_agg, on=KEYS, how="left", validate="m:1"
).merge(
    rain_agg, on=KEYS, how="left", validate="m:1"
)

# 3) 행 수 검증(무조건 동일해야 함)
assert len(out) == n0, f"행 수 증가/감소 발생! before={n0}, after={len(out)}"

# 결과
sw_koreanfood = out
print("OK. rows 동일:", len(sw_koreanfood))
print(sw_koreanfood[["TA_YMD","DONG","HOUR","TEMP","RAIN"]].head())

OK. rows 동일: 443523
     TA_YMD DONG  HOUR  TEMP  RAIN
0  20230101  파장동     1  2.10   0.0
1  20230101  파장동     2 -0.20   0.0
2  20230101  파장동     3 -2.25   0.0
3  20230101  파장동     4 -3.20   0.0
4  20230101  파장동     5 -4.10   0.0

In [49]:
sw_koreanfood

          TA_YMD  DONG  HOUR  DAY       AMT  CNT   UNIT   TEMP  RAIN
0       20230101   파장동     1    7    987830   17  58108   2.10   0.0
1       20230101   파장동     2    7    516279   20  25814  -0.20   0.0
2       20230101   파장동     3    7   2220711   76  29220  -2.25   0.0
3       20230101   파장동     4    7   9419194  230  40953  -3.20   0.0
4       20230101   파장동     5    7  17829061  364  48981  -4.10   0.0
...          ...   ...   ...  ...       ...  ...    ...    ...   ...
443518  20251031  광교2동     6    5   1624413  106  15325  11.65   1.5
443519  20251031  광교2동     7    5   6841204  185  36979  11.65   0.0
443520  20251031  광교2동     8    5  10899392  188  57975  10.70   0.0
443521  20251031  광교2동     9    5   4432221   62  71487   9.35   0.0
443522  20251031  광교2동    10    5    828374   17  48728  12.00   0.0

[443523 rows x 9 columns]

In [51]:
sw_koreanfood.isna().sum()

TA_YMD    0
DONG      0
HOUR      0
DAY       0
AMT       0
CNT       0
UNIT      0
TEMP      0
RAIN      0
dtype: int64

# 기타 확인용

In [47]:
gg_cmt_23 = pd.read_csv('C:/Users/Admin/AI/downloads/카드소비데이터 수원시/경기도 발달 골목 상권 추정 매출 현황(2023년)(11차기준).csv', encoding='cp949')
gg_cmt_23 = gg_cmt_23[gg_cmt_23['산업분류코드명'].isin(['커피 전문점', '기타 비알코올 음료점업'])].reset_index(drop=True)
gg_cmt_23.drop(['기준연도','산업분류코드','산업분류코드명'], inplace=True, axis=1)
gg_cmt_23 = gg_cmt_23.groupby(['상권명'], as_index=False)[['매출금액','매출건수']].sum()
gg_cmt_23

            상권명        매출금액    매출건수
0         CGV김포   827128864   98352
1       CGV김포운양  1969702293  321436
2        CGV부천역  3419007036  452230
3        CGV북수원  3036520735  498896
4         CGV이천  2573249177  216985
...         ...         ...     ...
1591       흥안대로   545829050   86551
1592  흥안대로427번길  1560512602  249043
1593  흥안대로456번길   635357424  122186
1594  흥안대로517번길   310391976   18941
1595        희망로    74047348   11684

[1596 rows x 3 columns]

In [41]:
sw_cafe = pd.read_csv('C:/Users/Admin/AI/downloads/카드소비데이터 수원시/행정동 단위 상가업소 조회.csv', encoding='cp949')
sw_cafe = sw_cafe[sw_cafe['시군명']=='수원시 팔달구'].reset_index(drop=True)
sw_cafe = sw_cafe[sw_cafe['상권업종소분류명']=='카페'].reset_index(drop=True)
sw_cafe.drop(['상권업종대분류명','상권업종중분류명','상권업종소분류명','표준산업분류명','건물명','시군명','지점명','소재지지번주소','소재지도로명주소','소재지우편번호'], inplace=True, axis=1)
sw_cafe.columns = ['상권명', '위도', '경도']
sw_cafe

         상권명         위도          경도
0        하우짓  37.281385  127.006748
1       미르카페  37.274646  127.027505
2         부터  37.285163  127.011423
3        윤카페  37.286813  127.031183
4       커피가이  37.283458  127.019881
...      ...        ...         ...
1129     블루힙  37.263067  127.031938
1130  호이차동수원  37.262746  127.030116
1131     루시퍼  37.265097  127.026827
1132      윙고  37.266303  127.034309
1133     용다방  37.268584  127.000782

[1134 rows x 3 columns]

In [45]:
result = pd.merge(
    gg_cmt_23,
    sw_cafe,
    on='상권명',      
    how='inner')
result

Empty DataFrame
Columns: [상권명, 매출금액, 매출건수, 위도, 경도]
Index: []

In [58]:
df = sw_koreanfood.groupby(['TA_YMD','HOUR'],as_index=False)[['AMT', 'CNT']].sum()
df

         TA_YMD  HOUR        AMT    CNT
0      20230101     1  232196906   5334
1      20230101     2   31254006   1101
2      20230101     3   79241901   3109
3      20230101     4  232153035   6615
4      20230101     5  423608138  10244
...         ...   ...        ...    ...
10345  20251031     6  239509025   7640
10346  20251031     7  357097967  10946
10347  20251031     8  524397137  12196
10348  20251031     9  306192645   6467
10349  20251031    10   82192950   1882

[10350 rows x 4 columns]

In [8]:
sw_koreanfood[(sw_koreanfood['DONG']=='광교2동') & (sw_koreanfood['TA_YMD']==20251030)]

          TA_YMD  DONG  HOUR  DAY       AMT  CNT    UNIT       TEMP  RAIN
443077  20251030  광교2동     1    4    576224   14   41159  15.642857   0.0
443078  20251030  광교2동     2    4    103817   20    5191  15.150000   0.0
443079  20251030  광교2동     3    4   2014805   72   27983  12.600000   0.0
443080  20251030  광교2동     4    4  11757125  458   25671  11.050000   0.0
443081  20251030  광교2동     5    4   5641112  246   22931   9.850000   0.0
443082  20251030  광교2동     6    4   1727053   72   23987   9.200000   0.0
443083  20251030  광교2동     7    4   4568894  194   23551   9.100000   0.0
443084  20251030  광교2동     8    4   6283613  139   45206   9.200000   0.0
443085  20251030  광교2동     9    4   8127305   56  145130   9.800000   0.0
443086  20251030  광교2동    10    4    228946   10   22895  12.300000   0.0

In [7]:
sw_koreanfood.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 443523 entries, 0 to 443522
Data columns (total 9 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   TA_YMD  443523 non-null  int64
 1   DONG    443523 non-null  object
 2   HOUR    443523 non-null  int64
 3   DAY     443523 non-null  int64
 4   AMT     443523 non-null  int64
 5   CNT     443523 non-null  int64
 6   UNIT    443523 non-null  int64
 7   TEMP    443523 non-null  float64
 8   RAIN    443523 non-null  float64
dtypes: float64(2), int64(6), object(1)
memory usage: 30.5+ MB

In [12]:
sw_koreanfood[(sw_koreanfood['TEMP']<-20) & (sw_koreanfood['TEMP']>-50)].head()

          TA_YMD  DONG  HOUR  DAY      AMT  CNT   UNIT   TEMP  RAIN
44054   20230413  영통1동     6    4   906445   57  15903 -21.05  -0.5
44074   20230413  영통3동     6    4  6485407  269  24109 -21.05  -0.5
192928  20240326   파장동     5    2  8487776  361  23512 -21.75  -0.5
192938  20240326   율천동     5    2  8361963  557  15013 -21.75  -0.5
192947  20240326  정자1동     5    2  1543178   89  17339 -21.75  -0.5

In [11]:
sw_koreanfood[sw_koreanfood['TEMP']<-40].head()

          TA_YMD  DONG  HOUR  DAY      AMT  CNT    UNIT  TEMP  RAIN
125354  20231020   파장동    10    5   294211    6   49035 -50.0  -1.0
125364  20231020   율천동    10    5  7305098  126   57977 -50.0  -1.0
125374  20231020  정자1동    10    5  1180883    9  131209 -50.0  -1.0
125384  20231020  정자2동    10    5   221214    8   27652 -50.0  -1.0
125394  20231020  정자3동    10    5  1044385   27   38681 -50.0  -1.0

In [33]:
sw_temp[(sw_temp['TA_YMD']==20231020) & (sw_temp['HOUR']==10)]

         DONG  TEMP  HOUR    TA_YMD
7031      파장동 -50.0    10  20231020
31871     율천동 -50.0    10  20231020
56711    정자1동 -50.0    10  20231020
81551    정자2동 -50.0    10  20231020
106391   정자3동 -50.0    10  20231020
131231    영화동 -50.0    10  20231020
156071    송죽동 -50.0    10  20231020
180911   조원1동 -50.0    10  20231020
205751   조원2동 -50.0    10  20231020
230591    연무동 -50.0    10  20231020
255431   세류1동 -50.0    10  20231020
280271   세류2동 -50.0    10  20231020
305111   세류3동 -50.0    10  20231020
329951     평동 -50.0    10  20231020
354791    서둔동 -50.0    10  20231020
379631    구운동 -50.0    10  20231020
404471    금곡동 -50.0    10  20231020
429311   호매실동 -50.0    10  20231020
454151   권선1동 -50.0    10  20231020
478991   권선2동 -50.0    10  20231020
503831    곡선동 -50.0    10  20231020
528671    입북동 -50.0    10  20231020
553511    매교동 -50.0    10  20231020
578351    매산동 -50.0    10  20231020
603191    고등동 -50.0    10  20231020
628031   화서1동 -50.0    10  20231020
652871   화서2동 -50.0    10  20231020
677711     지동 -50.0    10  20231020
702551   우만1동 -50.0    10  20231020
727391   우만2동 -50.0    10  20231020
752231    인계동 -50.0    10  20231020
777071    행궁동 -50.0    10  20231020
801911   매탄1동 -50.0    10  20231020
826751   매탄2동 -50.0    10  20231020
851591   매탄3동 -50.0    10  20231020
876431   매탄4동 -50.0    10  20231020
901271    원천동 -50.0    10  20231020
926111   영통1동 -50.0    10  20231020
950951   영통2동 -50.0    10  20231020
975791   영통3동 -50.0    10  20231020
1000631  망포1동 -50.0    10  20231020
1025471  망포2동 -50.0    10  20231020
1050311  광교1동 -50.0    10  20231020
1075151  광교2동 -50.0    10  20231020

In [14]:
sw_koreanfood

          TA_YMD  DONG  HOUR  DAY       AMT  CNT   UNIT   TEMP  RAIN
0       20230101   파장동     1    7    987830   17  58108   2.10   0.0
1       20230101   파장동     2    7    516279   20  25814  -0.20   0.0
2       20230101   파장동     3    7   2220711   76  29220  -2.25   0.0
3       20230101   파장동     4    7   9419194  230  40953  -3.20   0.0
4       20230101   파장동     5    7  17829061  364  48981  -4.10   0.0
...          ...   ...   ...  ...       ...  ...    ...    ...   ...
443518  20251031  광교2동     6    5   1624413  106  15325  11.65   1.5
443519  20251031  광교2동     7    5   6841204  185  36979  11.65   0.0
443520  20251031  광교2동     8    5  10899392  188  57975  10.70   0.0
443521  20251031  광교2동     9    5   4432221   62  71487   9.35   0.0
443522  20251031  광교2동    10    5    828374   17  48728  12.00   0.0

[443523 rows x 9 columns]

In [19]:
df = pd.read_csv('data/수원시 동 기상/고등동_기온_202301_202312.csv')
df

      format: day    hour  value location:60_120 Start : 20230101
0               1     0.0                                      0.1
1               1   100.0                                      1.2
2               1   200.0                                      2.2
3               1   300.0                                      3.2
4               1   400.0                                      3.0
...           ...     ...                                      ...
8766           31  1900.0                                     -1.4
8767           31  2000.0                                     -1.4
8768           31  2100.0                                     -1.7
8769           31  2200.0                                     -1.9
8770           31  2300.0                                     -0.2

[8771 rows x 3 columns]

In [38]:
x = df[df[' format: day']== ' 13']
x[72:96]

      format: day    hour  value location:60_120 Start : 20230101
2451           13     0.0                                     12.9
2452           13   100.0                                     13.8
2453           13   200.0                                     14.4
2454           13   300.0                                     15.7
2455           13   400.0                                     16.4
2456           13   500.0                                     17.5
2457           13   600.0                                     18.0
2458           13   700.0                                     17.9
2459           13   800.0                                     17.1
2460           13   900.0                                     14.9
2461           13  1000.0                                     12.9
2462           13  1100.0                                     11.7
2463           13  1200.0                                     11.0
2464           13  1300.0                                     11.0
2465           13  1400.0                                     10.3
2466           13  1500.0                                    -50.0
2467           13  1600.0                                     10.1
2468           13  1700.0                                      9.8
2469           13  1800.0                                      9.7
2470           13  1900.0                                      9.3
2471           13  2000.0                                      9.5
2472           13  2100.0                                     10.5
2473           13  2200.0                                     12.3
2474           13  2300.0                                     13.9

In [29]:
df[' format: day'].unique()

array([' 1', ' 2', ' 3', ' 4', ' 5', ' 6', ' 7', ' 8', ' 9', ' 10', ' 11',
       ' 12', ' 13', ' 14', ' 15', ' 16', ' 17', ' 18', ' 19', ' 20',
       ' 21', ' 22', ' 23', ' 24', ' 25', ' 26', ' 27', ' 28', ' 29',
       ' 30', ' 31', ' Start : 20230201 ', ' Start : 20230301 ',
       ' Start : 20230401 ', ' Start : 20230501 ', ' Start : 20230601 ',
       ' Start : 20230701 ', ' Start : 20230801 ', ' Start : 20230901 ',
       ' Start : 20231001 ', ' Start : 20231101 ', ' Start : 20231201 '],
      dtype=object)

In [41]:
sw_koreanfood.loc[sw_koreanfood['TEMP'] < -40, 'TEMP'] = 6.8
sw_koreanfood['TEMP'] = sw_koreanfood['TEMP'].astype(float)
sw_koreanfood.iloc[125354]

TA_YMD    20231020
DONG           파장동
HOUR            10
DAY              5
AMT         294211
CNT              6
UNIT         49035
TEMP           6.8
RAIN          -1.0
Name: 125354, dtype: object

In [43]:
sw_koreanfood.loc[(sw_koreanfood['TEMP']<-20) & (sw_koreanfood['TEMP']>-50), 'TEMP'] = 10.1
sw_koreanfood['TEMP'] = sw_koreanfood['TEMP'].astype(float)
sw_koreanfood.iloc[44054]

TA_YMD    20230413
DONG          영통1동
HOUR             6
DAY              4
AMT         906445
CNT             57
UNIT         15903
TEMP          10.1
RAIN          -0.5
Name: 44054, dtype: object

In [49]:
sw_koreanfood[sw_koreanfood['TEMP']<-20]

Empty DataFrame
Columns: [TA_YMD, DONG, HOUR, DAY, AMT, CNT, UNIT, TEMP, RAIN]
Index: []

In [16]:
sw_rain.loc[sw_rain['RAIN']<0, 'RAIN'] = 0
sw_rain.loc[[192,2463,4166,7031,10010,1070583,1075151,1078130,1078934,1091898],:]

         DONG  RAIN  HOUR    TA_YMD
192       파장동   0.0     1  20230109
2463      파장동   0.0     6  20230413
4166      파장동   0.0     5  20230623
7031      파장동   0.0    10  20231020
10010     파장동   0.0     1  20240222
1070583  광교2동   0.0     6  20230413
1075151  광교2동   0.0    10  20231020
1078130  광교2동   0.0     1  20240222
1078934  광교2동   0.0     5  20240326
1091898  광교2동   0.0     7  20250917

In [11]:
df = pd.read_csv('C:/Users/Admin/AI/downloads/shareData/서울시 상권분석서비스(추정매출-상권)_2024년.csv', encoding='cp949')

In [10]:
df = pd.read_csv('data/dong_grid.csv')

In [12]:
sw_temp

         DONG  TEMP  HOUR    TA_YMD
0         파장동   0.1     1  20230101
1         파장동   1.2     1  20230101
2         파장동   2.2     1  20230101
3         파장동   3.2     1  20230101
4         파장동   3.0     1  20230101
...       ...   ...   ...       ...
1092955  광교2동  11.1     8  20251031
1092956  광교2동  10.3     8  20251031
1092957  광교2동   9.4     9  20251031
1092958  광교2동   9.3     9  20251031
1092959  광교2동  12.0    10  20251031

[1092960 rows x 4 columns]